/* testData.js */
const testData = {
  "criteria": [
    "Аналізування стратегії діяльності організації та формулювання кадрової політики",
    "Стан корпоративної культури",
    "Наявність системи планування та моделювання посад",
    "Відповідність структури кадрового підрозділу організації кількості працівників та організаційний структурі",
    "Якісний аналіз інформаційних HRM-систем.",
    "Ефективність процесів пошуку персоналу",
    "Ефективність процесів відбору персоналу",
    "Аналізування системи адаптації нових працівників",
    "Впровадження систем оцінювання персоналу",
    "Рівень організації системи розвитку та збереження талантів"
  ],
  "questions": [
    {
      "id": "1.1.",
      "criterion": "Аналізування стратегії діяльності організації та формулювання кадрової політики",
      "text": "Чи є затверджена стратегія організації?",
      "options": [
        {
          "text": "Стратегія затверджена та працює, оперативні плани розробляються на її основі",
          "value": 3,
          "recommendation": "Узгодити всі кадрові процеси з оперативними планами, що випливають зі стратегії організації."
        },
        {
          "text": "Стратегія тільки затверджена",
          "value": 2,
          "recommendation": "Провести аудит персоналу та компетенцій для підготовки до впровадження стратегії."
        },
        {
          "text": "Стратегія у процесі розробки",
          "value": 1,
          "recommendation": "Залучити HR-підрозділ до формування стратегії організації та підготувати прогноз кадрових потреб"
        },
        {
          "text": "Стратегія не розроблялась",
          "value": 0,
          "recommendation": "Ініціювати розробку стратегії організації, використавши кадрову аналітику як базу для планування"
        }
      ]
    },
    {
      "id": "1.2.",
      "criterion": "Аналізування стратегії діяльності організації та формулювання кадрової політики",
      "text": "Наскільки стратегічні цілі відповідають викликам ринку?",
      "options": [
        {
          "text": "Повністю відповідають",
          "value": 3,
          "recommendation": "Здійснювати регулярний моніторинг ринкових умов здійснення діяльності, перевіряти стратегічні цілі на актуальність та у разі змін коригувати кадрову політику"
        },
        {
          "text": "Частково відповідають",
          "value": 2,
          "recommendation": "Проаналізувати розриви між цілями організації та умовами ринку. Для їх усунення внести корективи в кадрову політику"
        },
        {
          "text": "Не відповідають, або аналіз ринку не проводиться",
          "value": 1,
          "recommendation": "Провести комплексне дослідження ринкових умов, переглянути стратегічні цілі, визначитись з пріоритетами в кадровій політиці"
        },
        {
          "text": "Стратегічні цілі не сформульовано",
          "value": 0,
          "recommendation": "Запровадити стратегічне планування з визначенням пріоритетів розвитку кадрового потенціалу організації"
        }
      ]
    },
    {
      "id": "1.3.",
      "criterion": "Аналізування стратегії діяльності організації та формулювання кадрової політики",
      "text": "Чи проводиться аналіз зовнішнього середовища (SWOT, PESTEL)?",
      "options": [
        {
          "text": "Регулярно проводиться SWOT, PESTEL, на його основі вносяться зміни у стратегію",
          "value": 3,
          "recommendation": "Інтегрувати результати SWOT, PESTEL аналізу у кадрове планування та програми розвитку персоналу"
        },
        {
          "text": "SWOT або PESTEL-аналіз проводиться, однак в процесі планування результати враховуються частково",
          "value": 2,
          "recommendation": "Підвищити роль HR у використанні даних SWOT, PESTEL аналізу для коригування кадрової політики"
        },
        {
          "text": "SWOT або PESTEL-аналіз проводиться епізодично або для формального звітування",
          "value": 1,
          "recommendation": "Забезпечити системне та регулярне проведення SWOT або PESTEL-аналіз, а також на його основі оновлення кадрових рішень"
        },
        {
          "text": "Не проводиться",
          "value": 0,
          "recommendation": "Запровадити регулярне аналізування зовнішнього середовища організації, як основи для  розробки кадрової політики"
        }
      ]
    },
    {
      "id": "1.4.",
      "criterion": "Аналізування стратегії діяльності організації та формулювання кадрової політики",
      "text": "Чи розроблена система KPI?",
      "options": [
        {
          "text": "KPI застосовуються для усіх посад",
          "value": 3,
          "recommendation": "Забезпечити регулярний перегляд КРІ відповідно до стратегічних цілей"
        },
        {
          "text": "Система KPI працює для окремих посад",
          "value": 2,
          "recommendation": "Розширити систему KPI на всі ключові ролі."
        },
        {
          "text": "Система KPI у процесі розробки або система розроблена, але не працює",
          "value": 1,
          "recommendation": "Завершити впровадження та забезпечити навчання персоналу щодо роботи з KPI."
        },
        {
          "text": "Не застосовується",
          "value": 0,
          "recommendation": "Розробити систему KPI, що враховуватиме як бізнес-цілі, так і цілі розвитку персоналу"
        }
      ]
    },
    {
      "id": "1.5.",
      "criterion": "Аналізування стратегії діяльності організації та формулювання кадрової політики",
      "text": "Чи є сформульована кадрова політика?",
      "options": [
        {
          "text": "Визначені принципи кадрової політики. Працюють процедури набору, адаптації, мотивації, розвитку та утримання персоналу.",
          "value": 3,
          "recommendation": "Забезпечити підтримку та дієвість процедур набору, адаптації, мотивації, розвитку та утримання персоналу з контролем показників ефективності"
        },
        {
          "text": "Визначені принципи кадрової політики. Йде налаштування  процедур набору, адаптації, мотивації, розвитку та утримання персоналу",
          "value": 2,
          "recommendation": "Провести навчання працівників кадрової служби для більш ефективного впровадження процедур набору, адаптації, мотивації, розвитку та утримання персоналу, а також визначити показники ефективності для посилення контролю"
        },
        {
          "text": "Наразі розробляються процедури набору, адаптації, мотивації, розвитку та утримання персоналу",
          "value": 1,
          "recommendation": "Завершити розробку плану поетапного впровадження процедур набору, адаптації, мотивації, розвитку та утримання персоналу, визначити показники ефективності для посилення контролю"
        },
        {
          "text": "Не сформульована",
          "value": 0,
          "recommendation": "Ініціювати розробку плану поетапного впровадження процедур набору, адаптації, мотивації, розвитку та утримання персоналу для їх інтеграції з цілями організації"
        }
      ]
    },
    {
      "id": "1.6.",
      "criterion": "Аналізування стратегії діяльності організації та формулювання кадрової політики",
      "text": "Чи узгоджується кадрова політика з стратегічними цілями?",
      "options": [
        {
          "text": "Так, кадрова політика повністю інтегрована в стратегічне управління",
          "value": 3,
          "recommendation": "Забезпечити автоматичні інструменти перегляду кадрових пріоритетів в залежності від змін стратегії"
        },
        {
          "text": "Частково узгоджується",
          "value": 2,
          "recommendation": "Провести аудит кадрових процесів і вирівняти їх з усіма стратегічними цілями організації"
        },
        {
          "text": "Кадрова політика частково задекларована, однак її зв’язок зі стратегією слабкий або формальний",
          "value": 1,
          "recommendation": "Переглянути кадрову політику, закріпивши чіткий механізм її прив’язки до стратегічних завдань"
        },
        {
          "text": "Кадрова політика відсутня або здійснюється хаотично",
          "value": 0,
          "recommendation": "Сформувати напрями впровадження системного підходу до управління персоналом з урахуванням стратегічних пріоритетів"
        }
      ]
    },
    {
      "id": "1.7.",
      "criterion": "Аналізування стратегії діяльності організації та формулювання кадрової політики",
      "text": "Чи застосовуються бенчмаркинг при формуванні кадрової політики?",
      "options": [
        {
          "text": "Так, регулярно",
          "value": 3,
          "recommendation": "Продовжити систематично порівнювати підходи з управління персоналом з лідерами ринку та впроваджувати найкращі рішення"
        },
        {
          "text": "Іноді застосовується",
          "value": 2,
          "recommendation": "Зробити бенчмаркинг регулярною практикою та включити його результати у план розвитку персоналу"
        },
        {
          "text": "Планується застосувати",
          "value": 1,
          "recommendation": "Підготувати план впровадження бенчмаркингу для удосконалення процесу управління персоналом"
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Ініціювати впровадження бенчмаркингу для удосконалення процесу управління персоналом"
        }
      ]
    },
    {
      "id": "1.8.",
      "criterion": "Аналізування стратегії діяльності організації та формулювання кадрової політики",
      "text": "Чи є кадрова політика гнучкою та інклюзивною?",
      "options": [
        {
          "text": "Так, застосовуються віддалена робота, працюють гібридні команди, в кадровій політиці враховуються особливості різних генерацій",
          "value": 3,
          "recommendation": "Продовжити застосування гнучких форм роботи на основі аналізу їх ефективності"
        },
        {
          "text": "Частково.   Застосовуються одна або дві опції: віддалена робота, працюють гібридні команди, в кадровій політиці враховуються особливості різних генерацій",
          "value": 2,
          "recommendation": "Проаналізувати ефективність  існуючих гнучких форм роботи та доповнити їх тими, які ще не застосовуються ."
        },
        {
          "text": "Наразі планується впровадження гібридних команд, віддаленої роботи",
          "value": 1,
          "recommendation": "Запровадити гібридні команди та віддалену роботу, розробивши конкретний графік впровадження."
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Розробити комплексну кадрову політику та проаналізувати необхідність використання гнучких форм роботи: віддаленої роботи, гібридних команд, врахування особливостей різних генерацій"
        }
      ]
    },
    {
      "id": "1.9.",
      "criterion": "Аналізування стратегії діяльності організації та формулювання кадрової політики",
      "text": "Чи враховуються цифрові трансформації при формуванні кадрової політики?",
      "options": [
        {
          "text": "Так, активно впроваджуються цифрові інструменти",
          "value": 3,
          "recommendation": "Продовжити інтеграцію цифрових рішень в HR процесах з регулярною оцінкою їх ефективності та  навчанням персоналу"
        },
        {
          "text": "Почали впроваджуватись цифрові інструменти",
          "value": 2,
          "recommendation": "Розширити використання цифрових рішень в HR процесах, запровадити оцінку їх ефективності та навчання персоналу"
        },
        {
          "text": "Планується впровадження цифрових інструментів",
          "value": 1,
          "recommendation": "Розробити чіткий план цифровізації кадрових процесів з термінами та відповідальними."
        },
        {
          "text": "Не враховуються",
          "value": 0,
          "recommendation": "Започаткувати використання цифрових рішень в HR процесах, визначавши пріоритетні процеси для автоматизації та оптимізації"
        }
      ]
    },
    {
      "id": "1.10.",
      "criterion": "Аналізування стратегії діяльності організації та формулювання кадрової політики",
      "text": "Чи проводиться SWOT-аналіз персоналу?",
      "options": [
        {
          "text": "Так, регулярно проводиться та використовується у стратегічному плануванні",
          "value": 3,
          "recommendation": "Продовжити використання SWOT-аналізу персоналу при стратегічному плануванні"
        },
        {
          "text": "Почали проводити або проводиться епізодично",
          "value": 2,
          "recommendation": "Розробити план використання SWOT-аналізу персоналу та формалізувати його використання у кадровому плануванні"
        },
        {
          "text": "Планується проводити",
          "value": 1,
          "recommendation": "Розробити графік проведення SWOT-аналізу персоналу та визначити відповідальних за його реалізацію."
        },
        {
          "text": "Не проводиться і не планується",
          "value": 0,
          "recommendation": "Ініціювати впровадження  використання SWOT-аналізу персоналу для виявлення його сильних та слабких сторін"
        }
      ]
    },
    {
      "id": "2.1.",
      "criterion": "Стан корпоративної культури",
      "text": "Чи є прописані норми, правила та цінності організації?",
      "options": [
        {
          "text": "Норми, правила та цінності організації прописані",
          "value": 3,
          "recommendation": "Підтримувати та популяризувати корпоративні норми та цінності, інтегрувати їх у систему розвитку та оцінки персоналу"
        },
        {
          "text": "Норми, правила та цінності організації розробляються",
          "value": 2,
          "recommendation": "Завершити роботу по впровадженню корпоративних норм та цінностей для підвищення ефективності персоналу"
        },
        {
          "text": "Планується розробити норми, правила та цінності організації",
          "value": 1,
          "recommendation": "Розробити план впровадження корпоративних норм та цінностей для підвищення ефективності персоналу із залученням ключових співробітників"
        },
        {
          "text": "Не прописані і не планується",
          "value": 0,
          "recommendation": "Ініціювати впровадження корпоративних норм та цінностей для створення єдиної культури та підвищення ефективності HR-процесів"
        }
      ]
    },
    {
      "id": "2.2.",
      "criterion": "Стан корпоративної культури",
      "text": "Яким є тип корпоративної культури?",
      "options": [
        {
          "text": "Тип корпоративної культури визначено і вона повністю відповідає стратегії організації",
          "value": 3,
          "recommendation": "Продовжувати підтримку та інтеграцію корпоративної культури в усі процеси формування та розвитку персоналу"
        },
        {
          "text": "Тип корпоративної культури визначено формально і він частково відповідає стратегії організації",
          "value": 2,
          "recommendation": "Узгодити корпоративну культуру з реальними процесами та стратегією організації для підвищення ефективності кадрової системи"
        },
        {
          "text": "Культура є, але не систематизована",
          "value": 1,
          "recommendation": "Систематизувати існуючу культуру, оформити норм, правила та цінності для чіткої орієнтації персоналу"
        },
        {
          "text": "Тип корпоративної культури не визначений, не ідентифікований або відсутній повністю",
          "value": 0,
          "recommendation": "Сформулювати основи корпоративної культури, визначити її тип, цінності та правила"
        }
      ]
    },
    {
      "id": "2.3.",
      "criterion": "Стан корпоративної культури",
      "text": "Чи є корпоративні культура реальною чи формальною?",
      "options": [
        {
          "text": "Реальна корпоративна культура відповідає задекларованій, розділяється членами організації",
          "value": 3,
          "recommendation": "Підтримувати відповідність задекларованих і реальних цінностей, відобразити їх у процедурах розвитку та оцінки персоналу"
        },
        {
          "text": "Є часткова відповідність між задекларованою та реальною культурою",
          "value": 2,
          "recommendation": "Усунути розбіжності між задекларованою і реальною культурою, інтегрувати цінності у щоденні практики та процеси"
        },
        {
          "text": "Проводиться робота по формуванню корпоративної культури",
          "value": 1,
          "recommendation": "Прискорити формування культури, формалізувавши норми, правила та ключові цінності."
        },
        {
          "text": "Корпоративна культура не аналізується",
          "value": 0,
          "recommendation": "Розробити заходи по формуванню в організації корпоративної культури для створення єдиного культурного середовища"
        }
      ]
    },
    {
      "id": "2.4.",
      "criterion": "Стан корпоративної культури",
      "text": "Чи налагоджена ефективна взаємодія та комунікація?",
      "options": [
        {
          "text": "Так, комунікація добре налагоджена між рівнями управління, керівники надають зворотній зв’язок підлеглим, проводиться навчання прийомам ефективної комунікації",
          "value": 3,
          "recommendation": "Підтримувати ефективну взаємодію, регулярно оцінювати якість зворотного зв’язку, який надається керівниками"
        },
        {
          "text": "Так, комунікація частково налагоджена між рівнями управління, керівники надають зворотній зв’язок підлеглим, але не регулярно",
          "value": 2,
          "recommendation": "Організувати навчання прийомам ефективної комунікації та вдосконалити підходи до оцінки якість зворотного зв’язку"
        },
        {
          "text": "Планується налагодити комунікацію між рівнями управління",
          "value": 1,
          "recommendation": "Розробити план налагодження комунікації між рівнями управління, організувати навчання прийомам ефективної комунікації та зворотного зв’язку"
        },
        {
          "text": "Комунікація між рівнями управління не налагоджена,  бракує зворотного зв'язку",
          "value": 0,
          "recommendation": "Ініціювати системне впровадження ефективних каналів комунікації та механізмів зворотного зв’язку на усіх рівнях управління"
        }
      ]
    },
    {
      "id": "2.5.",
      "criterion": "Стан корпоративної культури",
      "text": "Чи підтримується ініціативність працівників?",
      "options": [
        {
          "text": "Так, відповідні показники включені у систему КРІ, вони прив’язані до мотиваційних заходів щодо підвищення ініціативності",
          "value": 3,
          "recommendation": "Продовжувати підтримку ініціативності через мотиваційні заходи та регулярний аналіз показників КРІ."
        },
        {
          "text": "Так, однак без формалізації у системі КРІ",
          "value": 2,
          "recommendation": "Формалізувати показники ініціативності у системі КРІ та впровадити відповідні мотиваційні механізми"
        },
        {
          "text": "Наразі розробляються заходи щодо підвищення ініціативності",
          "value": 1,
          "recommendation": "Прискорити впровадження заходів для стимулювання ініціативності та закріпити їх у системі оцінки персоналу"
        },
        {
          "text": "Ні, і не планується",
          "value": 0,
          "recommendation": "Розробити та впровадити механізми підтримки ініціативності для підвищення залученості та продуктивності працівників"
        }
      ]
    },
    {
      "id": "2.6.",
      "criterion": "Стан корпоративної культури",
      "text": "Чи аналізується рівень лояльності працівників організації?",
      "options": [
        {
          "text": "Так, проводяться регулярні опитування працівників, застосовуються відповідні методики",
          "value": 3,
          "recommendation": "Продовжити регулярний аналіз рівня  лояльності працівників та використовувати його результати для удосконалення кадрової політики"
        },
        {
          "text": "Так, аналізується на основі непрямих показників",
          "value": 2,
          "recommendation": "Доповнити непрямі показники рівня  лояльності працівників опитуваннями для біль об’єктивних результатів"
        },
        {
          "text": "Планується запровадити відповідний аналіз",
          "value": 1,
          "recommendation": "Розробити та впровадити систему оцінки лояльності з регулярними опитуваннями та аналітикою."
        },
        {
          "text": "Ні, і не планується",
          "value": 0,
          "recommendation": "Ініціювати впровадження механізмів оцінювання рівня лояльності працівників"
        }
      ]
    },
    {
      "id": "2.7.",
      "criterion": "Стан корпоративної культури",
      "text": "Чи аналізується рівень задоволеності працівників?",
      "options": [
        {
          "text": "Так, проводяться регулярні опитування працівників, застосовуються відповідні методики",
          "value": 3,
          "recommendation": "Продовжувати регулярний аналіз задоволеності та використовувати його результати для вдосконалення кадрової політики."
        },
        {
          "text": "Так, аналізується на основі непрямих показників",
          "value": 2,
          "recommendation": "Доповнити непрямі показники регулярними опитуваннями для точнішої оцінки задоволеності працівників."
        },
        {
          "text": "Планується запровадити відповідні опитування",
          "value": 1,
          "recommendation": "Розробити та впровадити систему оцінки задоволеності з регулярними опитуваннями та аналітикою."
        },
        {
          "text": "Ні, і не планується",
          "value": 0,
          "recommendation": "Ініціювати впровадження механізмів оцінювання задоволеності працівників"
        }
      ]
    },
    {
      "id": "2.8.",
      "criterion": "Стан корпоративної культури",
      "text": "Чи залучаються працівники до управління?",
      "options": [
        {
          "text": "Так, колектив залучається до розробки стратегічних та оперативних планів. Застосовуються колективні стратсесії.",
          "value": 3,
          "recommendation": "Продовжувати залучення працівників до розробки стратегічних та оперативних планів через колективні сесії"
        },
        {
          "text": "Частково, колектив залучається до розробки оперативних планів",
          "value": 2,
          "recommendation": "Розширити залучення працівників до стратегічного планування та прийняття рішень через колективні стратсесії"
        },
        {
          "text": "Планується залучати",
          "value": 1,
          "recommendation": "Розробити план інтеграції працівників у процеси управління з чіткими термінами та механізмами участі"
        },
        {
          "text": "Ні, і не планується",
          "value": 0,
          "recommendation": "Ініціювати впровадження механізмів залучення персоналу до управління та прийняття рішень"
        }
      ]
    },
    {
      "id": "2.9.",
      "criterion": "Стан корпоративної культури",
      "text": "Чи проводяться корпоративні заходи для підтримання культури?",
      "options": [
        {
          "text": "Так, розроблена та працює система заходів для підтримання культури",
          "value": 3,
          "recommendation": "Продовжувати регулярне проведення заходів і оцінювати їхній вплив на корпоративну культуру."
        },
        {
          "text": "Проводяться епізодично",
          "value": 2,
          "recommendation": "Систематизувати проведення заходів по підтриманню корпоративної культури, створити регулярний календар активностей для її підтримки"
        },
        {
          "text": "Планується розробити систему корпоративних заходів",
          "value": 1,
          "recommendation": "Розробити та впровадити  систему заходів по підтриманню корпоративної культури з чітким планом та відповідальними"
        },
        {
          "text": "Ні, і не планується",
          "value": 0,
          "recommendation": "Ініціювати розробку корпоративних заходів для формування та зміцнення корпоративної культури."
        }
      ]
    },
    {
      "id": "2.10.",
      "criterion": "Стан корпоративної культури",
      "text": "Чи є літопис організації?",
      "options": [
        {
          "text": "Так, інформація постійно оновлюється та використовується для підтримання корпоративної культури",
          "value": 3,
          "recommendation": "Продовжити вести літопис організації, інтегрувати його матеріали у розвиток корпоративної культури та навчання персоналу"
        },
        {
          "text": "Ведеться не регулярно",
          "value": 2,
          "recommendation": "Впорядкувати ведення літопису організації, контролювати його регулярне оновлення та використання у навчанні персоналу"
        },
        {
          "text": "Планується почати",
          "value": 1,
          "recommendation": "Розробити план створення літопису з визначенням відповідальних і періодичності оновлення."
        },
        {
          "text": "Ні, і не планується",
          "value": 0,
          "recommendation": "Вивчити кращі практики використання літопису для підтримки корпоративної культури та провести обговорення необхідності його створення літопису для фіксації історії організації"
        }
      ]
    },
    {
      "id": "3.1.",
      "criterion": "Наявність системи планування та моделювання посад",
      "text": "Чи існує практика стратегічного планування потреб у персоналі?",
      "options": [
        {
          "text": "Застосовується короткотермінове, середньотермінове, довготермінове планування",
          "value": 3,
          "recommendation": "Продовжити існуючу практику стратегічного планування потреб у персоналі та інтегрувати її з розвитком компетенцій і системою кар’єрного зростання"
        },
        {
          "text": "Застосовується короткотермінове, середньотермінове",
          "value": 2,
          "recommendation": "Впровадити довготермінове планування потреб у персоналі з метою прогнозування"
        },
        {
          "text": "Застосовується короткотермінове планування",
          "value": 1,
          "recommendation": "Розширити планування потреб у персоналі  до рівня середньотермінового та довготермінового для більшої стабільності кадрової системи"
        },
        {
          "text": "Такої практики немає і не планується впроваджувати",
          "value": 0,
          "recommendation": "Вивчити кращі практики використання стратегічного планування потреб у персоналі  та провести обговорення необхідності його запровадження"
        }
      ]
    },
    {
      "id": "3.2.",
      "criterion": "Наявність системи планування та моделювання посад",
      "text": "Чи застосовуються GAP-аналіз для аналізування стану роботи з кадрами?",
      "options": [
        {
          "text": "Так, постійно",
          "value": 3,
          "recommendation": "Продовжити існуючу практику GAP-аналізу стану роботи з кадрами та використання його результатів для коригування кадрової політики"
        },
        {
          "text": "Так, епізодично",
          "value": 2,
          "recommendation": "Перевести на регулярну основу практику GAP-аналізу стану роботи з кадрами та використання його результатів для коригування кадрової політики"
        },
        {
          "text": "Планується застосувати",
          "value": 1,
          "recommendation": "Розробити план впровадження  GAP-аналізу стану роботи з кадрами з визначенням частоти проведення та відповідальних"
        },
        {
          "text": "Ні, і не планується застосовувати",
          "value": 0,
          "recommendation": "Вивчити кращі практики використання GAP-аналізу стану роботи з кадрами та провести обговорення необхідності його запровадження для виявлення прогалин у роботі з персоналом та підвищення його ефективності"
        }
      ]
    },
    {
      "id": "3.3.",
      "criterion": "Наявність системи планування та моделювання посад",
      "text": "Скільки підрозділів задіяні у стратегічному плануванні персоналу?",
      "options": [
        {
          "text": "Усі підрозділи",
          "value": 3,
          "recommendation": "Продовжити інтегрування усіх підрозділів у стратегічне планування персоналу та покращення координації між ними"
        },
        {
          "text": "Тільки кадровий підрозділ",
          "value": 2,
          "recommendation": "Розширити залучення інших підрозділів до стратегічного планування для забезпечення комплексного підходу до розвитку персоналу"
        },
        {
          "text": "Такої практики немає, але планується впроваджувати",
          "value": 1,
          "recommendation": "Розробити план залучення підрозділів до стратегічного планування персоналу з чіткими термінами та відповідальними"
        },
        {
          "text": "Такої практики немає і не планується впроваджувати",
          "value": 0,
          "recommendation": "Вивчити кращі практики залучення підрозділів до стратегічного планування персоналу та провести обговорення необхідності його запровадження"
        }
      ]
    },
    {
      "id": "3.4.",
      "criterion": "Наявність системи планування та моделювання посад",
      "text": "Чи добре налагоджена взаємодія між підрозділами, які залучені у процес планування потреб у персоналі?",
      "options": [
        {
          "text": "Так",
          "value": 3,
          "recommendation": "Підтримувати існуючий рівень взаємодії між підрозділами, які залучені у процес планування потреб у персоналі, та вдосконалювати комунікаційні канали для більшої ефективності"
        },
        {
          "text": "Є потреба в удосконаленні процесу",
          "value": 2,
          "recommendation": "Оптимізувати процес взаємодії між підрозділами, які залучені у процес планування потреб у персоналі, та запровадити регулярні координаційні зустрічі"
        },
        {
          "text": "Такої практики немає, але планується впроваджувати",
          "value": 1,
          "recommendation": "Розробити план покращення взаємодії між підрозділами, які залучені у процес планування потреб у персоналі, з визначенням термінів та відповідальних"
        },
        {
          "text": "Такої практики немає і не планується впроваджувати",
          "value": 0,
          "recommendation": "Вивчити кращі практики налагодження взаємодії між підрозділами, які залучені у процес планування потреб у персоналі, та провести обговорення необхідності його запровадження"
        }
      ]
    },
    {
      "id": "3.5.",
      "criterion": "Наявність системи планування та моделювання посад",
      "text": "Чи передбачено формування кадрового резерву?",
      "options": [
        {
          "text": "Так, усталена практика",
          "value": 3,
          "recommendation": "Продовжити розвиток кадрового резерву та регулярно оцінювати його ефективність"
        },
        {
          "text": "Так, на етапі формування",
          "value": 2,
          "recommendation": "Завершити формування кадрового резерву та інтегрувати його у систему розвитку та просування персоналу"
        },
        {
          "text": "Такої практики немає, але планується впроваджувати",
          "value": 1,
          "recommendation": "Розробити план створення кадрового резерву з визначенням критеріїв відбору та термінів реалізації."
        },
        {
          "text": "Такої практики немає і не планується впроваджувати",
          "value": 0,
          "recommendation": "Вивчити кращі практики формування кадрового резерву та провести обговорення необхідності його запровадження для забезпечення готовності організації до змін та стратегічного розвитку"
        }
      ]
    },
    {
      "id": "3.6.",
      "criterion": "Наявність системи планування та моделювання посад",
      "text": "Чи є формалізований опис кожної посади?",
      "options": [
        {
          "text": "Так, чітко прописаний функціонал, вимоги, обов’язки працівників, КРІ",
          "value": 3,
          "recommendation": "Продовжити підтримку актуальності описів посад та інтегрувати їх у систему розвитку та оцінки персоналу"
        },
        {
          "text": "Так, прописаний функціонал, вимоги, обов’язки працівників, але є потреба в удосконаленні процесу",
          "value": 2,
          "recommendation": "Оновити та стандартизувати  опису посад для підвищення прозорості та ефективності управління персоналу"
        },
        {
          "text": "Ні, але планується впроваджувати",
          "value": 1,
          "recommendation": "Розробити план формалізації описів посад з визначенням відповідальних та термінів реалізації."
        },
        {
          "text": "Ні, потреби в цьому немає",
          "value": 0,
          "recommendation": "Ініціювати створення описів посад для підвищення ефективності управління та оцінки персоналу."
        }
      ]
    },
    {
      "id": "3.7.",
      "criterion": "Наявність системи планування та моделювання посад",
      "text": "Чи застосовується компетентністний підхід при формуванні профілю посади?",
      "options": [
        {
          "text": "Так, для цього розроблено відповідні методики",
          "value": 3,
          "recommendation": "Продовжити застосування компетентністного підходу при формуванні профілю посади і регулярно оновлювати методики відповідно до змін у стратегії та ринкових умов"
        },
        {
          "text": "Частково, на етапі впровадження",
          "value": 2,
          "recommendation": "Завершити впровадження компетентністного підходу та інтегрувати його у всі профілі при формуванні профілю посад"
        },
        {
          "text": "Ні, але планується впроваджувати",
          "value": 1,
          "recommendation": "Розробити план впровадження компетентністного підходу при формуванні профілю посади з визначенням етапів та відповідальних осіб"
        },
        {
          "text": "Ні, потреби в цьому немає",
          "value": 0,
          "recommendation": "Розглянути необхідність застосування компетентністного підходу при формуванні профілю посади для підвищення якості підбору та розвитку персоналу"
        }
      ]
    },
    {
      "id": "3.8.",
      "criterion": "Наявність системи планування та моделювання посад",
      "text": "Чи оновлюються моделі посад, виводяться застарілі посади?",
      "options": [
        {
          "text": "Так, оновлення посад відбувається відповідно до стратегії організації та  умов ринку праці",
          "value": 3,
          "recommendation": "Продовжити системне оновлення моделей посад і регулярно перевіряти їх актуальність шодо стратегічних цілей"
        },
        {
          "text": "Так, оновлення посад відбувається за наказами керівництва",
          "value": 2,
          "recommendation": "Перейти до більш системного підходу, інтегрувавши оновлення посад у регулярний стратегічний процес."
        },
        {
          "text": "Планується оновлювати",
          "value": 1,
          "recommendation": "Розробити чіткий графік та процедури оновлення посад із визначенням відповідальних осіб."
        },
        {
          "text": "Моделі посад не розроблено",
          "value": 0,
          "recommendation": "Ініціювати розробку моделей посад для системного управління персоналом  та відповідності стратегії організації"
        }
      ]
    },
    
    {
      "id": "3.9",
      "criterion": "Наявність системи планування та моделювання посад",
      "text": "Чи є в обв’язках HR-служби аналізування дублювання посад?",
      "options": [
        { "text": "Так, вимога формально прописана у посадових обов’язках та аналізується регулярно", "value": 3, "recommendation": "Продовжити регулярний аналіз дублювання посад і використовувати результати для оптимізації структури персоналу." },
        { "text": "Так, але не регулярно проводиться", "value": 2, "recommendation": "Впровадити системний графік аналізу дублювання посад для підвищення ефективності HR-процесів." },
        { "text": "Планується включити", "value": 1, "recommendation": "Офіційно додати аналіз дублювання посад до обов’язків HR-служби та визначити відповідальних осіб." },
        { "text": "Ні, і не планується", "value": 0, "recommendation": "Розглянути доцільність включення аналізу дублювання посад для оптимізації структури організації та уникнення надмірності штату." }
      ]
    },
{
      "id": "3.10.",
      "criterion": "Наявність системи планування та моделювання посад",
      "text": "Чи є в організації  посади пов’язані з цифровою трансформацією?",
      "options": [
        {
          "text": "Так, є окрема посада",
          "value": 3,
          "recommendation": "Продовжити розвиток компетенцій на посаді, що пов’язана з цифровою трансформацією та інтегрувати її у стратегічні проєкти"
        },
        {
          "text": "Включено як додаткові обов’язки",
          "value": 2,
          "recommendation": "Розглянути виділення окремої посади для ефективного управління цифровою трансформацією."
        },
        {
          "text": "Планується запровадити",
          "value": 1,
          "recommendation": "Розробити план створення посади, що буде пов’язана з цифровою трансформацією, визначити функції, вимоги та терміни впровадження"
        },
        {
          "text": "Ні, і не планується",
          "value": 0,
          "recommendation": "Оцінити потреби у цифровій трансформації та визначити доцільність запровадження відповідної посади"
        }
      ]
    },
    {
      "id": "4.1.",
      "criterion": "Відповідність структури кадрового підрозділу організації кількості працівників та організаційний структурі",
      "text": "Яким тип організаційної структури організації? (скільки філій, регіонів)",
      "options": [
        {
          "text": "В організації сформована структурована модель, яка передбачає розподіл HR-функцій між центральним офісом та філіями (відокремленими підрозділами). У структурі є локальні HR-фахівці чи регіональні підрозділи, що діють згідно з єдиною політикою формування персоналу.",
          "value": 3,
          "recommendation": "Продовжувати підтримувати єдність HR-політик та підвищувати ефективність локальних HR-підрозділів через стандартизацію процесів і обмін кращими практиками. Продовжувати вдосконалення централізованих HR-процесів та впроваджувати стандарти для підвищення ефективності управління персоналом."
        },
        {
          "text": "Організація має мережу філій чи регіональних представництв, у яких частково реалізуються HR-функції, проте немає єдиної стратегії розвитку персоналу або вона не реалізується повністю на місцях.",
          "value": 2,
          "recommendation": "Розробити та впровадити узгоджену HR-стратегію для усіх філій (для усіх рівнів організації), забезпечити стандартизацію та контроль"
        },
        {
          "text": "Є базова централізована структура, але HR-функції здебільшого зосереджені в головному офісі. В регіонах/філіях немає кадрової автономії, формування персоналу не пристосоване до локальних потреб.",
          "value": 1,
          "recommendation": "Формалізувати процеси підбору, адаптації та розвитку персоналу, створивши чіткі ролі та розподіл відповідальності у центральному HR-підрозділі. Делегувати частину  HR-функцій регіональним підрозділам та адаптувати процеси до місцевих потреб для підвищення ефективності"
        },
        {
          "text": "Організаційна структура не визначена/неврегульована. Відсутнє чітке розмежування підрозділів (центральний/регіональний рівень), HR-процеси хаотичні, немає системи підбору/адаптації.",
          "value": 0,
          "recommendation": "Ініціювати побудову чіткої організаційної структури з розмежуванням ролей та впровадження системних HR-процесів, впровадити системні процеси підбору, розвитку та мотивації персоналу"
        }
      ]
    },
    {
      "id": "4.2.",
      "criterion": "Відповідність структури кадрового підрозділу організації кількості працівників та організаційний структурі",
      "text": "Чи є окремий підрозділ (підрозділи), який займається роботою з персоналом? (його чисельність, кількість HR-фахівців на кількість працівників) 1 на 50-100",
      "options": [
        {
          "text": "У структурі є повноцінний HR-підрозділ або кадрова служба з кількома фахівцями з різних напрямків. Співвідношення кількості HR до персоналу  – 1 до 50-100 працівників.",
          "value": 3,
          "recommendation": "Продовжувати розвивати компетенції HR-підрозділу та оптимізувати процеси для ефективного управління персоналом"
        },
        {
          "text": "Є окремий HR-фахівець або невеликий підрозділ (1–2 особи), який займається лише кадрами. Співвідношення кількості HR до персоналу — 1 на 100–150 працівників.",
          "value": 2,
          "recommendation": "Розглянути можливість збільшення чисельності HR-підрозділу або делегування чистини функцій для забезпечення системності HR-процесів"
        },
        {
          "text": "Є один працівник, який поєднує HR-функції з іншими (наприклад, бухгалтер, офіс-менеджер). Співвідношення кількості HR до персоналу — понад 1 на 150.",
          "value": 1,
          "recommendation": "Впровадити окрему HR-позицію для концентрації на кадрових процесах та підвищення їх ефективності."
        },
        {
          "text": "HR-функції формально не виокремлені або повністю покладені на інших працівників (бухгалтер, офіс-менеджер, директор тощо). Немає виділених фахівців із персоналу.",
          "value": 0,
          "recommendation": "Створити окремий HR-підрозділ або виділену HR-позицію для системного управління персоналом."
        }
      ]
    },
    {
      "id": "4.3.",
      "criterion": "Відповідність структури кадрового підрозділу організації кількості працівників та організаційний структурі",
      "text": "Які основні функції виконує HR-підрозділ?",
      "options": [
        {
          "text": "HR-підрозділ  працює системно, у повному обсязі  виконує функції стратегічного управління людськими ресурсами, забезпечує функції найму, адаптації, навчання, з глибокою аналітикою та плануванням.",
          "value": 3,
          "recommendation": "Продовжувати розвивати аналітику та автоматизацію, впроваджуючи інноваційні практики управління персоналом"
        },
        {
          "text": "HR-підрозділ  працює системно, частково виконує функції стратегічного управління людськими ресурсами, забезпечує функції найму, адаптації, навчання, але без глибокої аналітики чи планування.",
          "value": 2,
          "recommendation": "Розширити аналітичні та стратегічні функції, інтегрувавши довгострокове планування та оцінку ефективності HR-процесів"
        },
        {
          "text": "HR-підрозділ виконує лише формальні обов’язки. Підбір персоналу та розвиток здійснюється ситуативно. Адаптація, навчання та оцінювання — відсутні або неструктуровані.",
          "value": 1,
          "recommendation": "Впровадити системні процеси підбору, адаптації, навчання та оцінювання персоналу."
        },
        {
          "text": "HR-система відсутня або на рівні «паперової» кадрової служби. Рекрутинг, розвиток, адаптація не регламентовані.",
          "value": 0,
          "recommendation": "Створити структурований HR-підрозділ із регламентованими процесами рекрутингу, адаптації, розвитку та оцінки персоналу."
        }
      ]
    },
    {
      "id": "4.4.",
      "criterion": "Відповідність структури кадрового підрозділу організації кількості працівників та організаційний структурі",
      "text": "Чи відповідає рівень кадрової підтримки структурі та складності організації?",
      "options": [
        {
          "text": "Так, повністю. HR-підтримка пропорційно розподілена по всій структурі компанії (включно з філіями, бізнес-напрямами, департаментами). Є профільні HR-фахівці (рекрутери, L&D, аналітики), рівень обслуговування відповідає складності організації.",
          "value": 3,
          "recommendation": "Продовжувати підтримати баланс навантаження та розвивати спеціалізацію HR-фахівців відповідно до стратегічних потреб"
        },
        {
          "text": "HR-підтримка формально відповідає масштабам (є фахівці на ключових рівнях), але функціональна повнота або глибина взаємодії з регіональними/профільними підрозділами ще не на бажаному рівні.",
          "value": 2,
          "recommendation": "Поглибити взаємодію HR з регіональними/профільними підрозділами, розширивши функціональні можливості підтримки: запровадити щомісячні координаційні зустрічі  HR з керівниками профільних підрозділів або створити єдиний комунікаційний канал для оперативного обміну кадровими питаннями, розробити персоналізовані аналітичні HR-звіти для кожного підрозділу."
        },
        {
          "text": "Підрозділ, який виконує HR-функції, не збалансований за структурою.",
          "value": 1,
          "recommendation": "Оптимізувати навантаження на  HR-фахівців, розподіливши функції  між центральним офісом і регіонами"
        },
        {
          "text": "HR-відділ або відсутній, або не масштабується відповідно до структури організації. HR-навантаження на одну людину надмірне, філії/відділення залишені без підтримки.",
          "value": 0,
          "recommendation": "Створити структурований HR-відділ і розподілити HR-функції пропорційно до організаційної структури."
        }
      ]
    },
    {
      "id": "4.5.",
      "criterion": "Відповідність структури кадрового підрозділу організації кількості працівників та організаційний структурі",
      "text": "Чи відповідає обсяг функцій щодо забезпечення формування персоналу кількості співробітників кадрового підрозділу? Чи є кадровий підрозділ перевантаженим?",
      "options": [
        {
          "text": "Так, обсяг функцій щодо забезпечення формування персоналу кількості співробітників кадрового підрозділу. Кадровий підрозділ не є перевантаженим",
          "value": 3,
          "recommendation": "Підтримувати поточну пропорцію функцій і навантаження співробітників кадрового підрозділу, поступово впроваджуючи інновації та автоматизацію HR-процесів"
        },
        {
          "text": "Підрозділ, який виконує HR-функції, не збалансований по функціям, обсяг функцій не відповідає кількості співробітників. Кадровий підрозділ помірно перевантажений.",
          "value": 2,
          "recommendation": "Оптимізувати процеси, делегувати частину функцій співробітників кадрового підрозділу за рахунок впровадження цифрових HRM-рішень для рекрутингу, онбордингу, а також використання цифрових шаблонів документів та звітів, або залучити додаткових HR-фахівців чи передати частину функцій кадрового підрозділу на аутсорсинг"
        },
        {
          "text": "Кадровий підрозділ дуже перевантажений",
          "value": 1,
          "recommendation": "Збільшити чисельність HR-фахівців або впровадити автоматизацію та стандартизацію процесів для зменшення їх навантаження"
        },
        {
          "text": "Це питання не аналізувалось",
          "value": 0,
          "recommendation": "Провести аудит HR-функцій і навантаження, щоб визначити відповідність чисельності підрозділу потребам організації. Внести зміни у штатний розпис"
        }
      ]
    },
    {
      "id": "4.6.",
      "criterion": "Відповідність структури кадрового підрозділу організації кількості працівників та організаційний структурі",
      "text": "Чи є вузькопрофільні фахівці HRM?",
      "options": [
        {
          "text": "HR-підрозділ – команда вузькопрофільних фахівців з чітко визначеними функціями (кадровик, аналітик, рекрутер).",
          "value": 3,
          "recommendation": "Підтримувати існуючий поділ функцій HRM та розвивати експертизу через навчання й сертифікації"
        },
        {
          "text": "В HR-підрозділі присутній частковий поділ функцій, однак не уся сфера HR покрита окремими спеціалістами або усі працівники – універсали.",
          "value": 2,
          "recommendation": "Розглянути найм або навчання вузькопрофільних HR-фахівців для покриття всіх критичних напрямів."
        },
        {
          "text": "Один працівник виконує усі функції HRM або дуже мала команда без чіткого розподілу обов’язків.",
          "value": 1,
          "recommendation": "Розширити команду та запровадити чіткий розподіл HR-функцій між спеціалістами."
        },
        {
          "text": "Немає окремої посади HRM",
          "value": 0,
          "recommendation": "Створити HR-підрозділ або призначити відповідальну особу для системного управління персоналом."
        }
      ]
    },
    {
      "id": "4.7.",
      "criterion": "Відповідність структури кадрового підрозділу організації кількості працівників та організаційний структурі",
      "text": "Чи є функції HRM, які передано на аутсорсинг?",
      "options": [
        {
          "text": "Так, HR-аутсорсинг застосовується як інструмент стратегічного управління, є ретельно підібрані партнери.",
          "value": 3,
          "recommendation": "Продовжувати оптимізувати взаємодію з партнерами та оцінювати ефективність аутсорсингових рішень."
        },
        {
          "text": "Передано частину операційних HR-функцій (кадровий облік, рекрутинг, навчання персоналу)",
          "value": 2,
          "recommendation": "Розширити перелік функцій, що передаються на аутсорсинг, або спровадити стандартизацію та контроль якості"
        },
        {
          "text": "Планується передати або передано на аутсорсинг лише незначні або технічні HR-функції.",
          "value": 1,
          "recommendation": "Оцінити можливості аутсорсингу для зменшення навантаження на внутрішній HR-підрозділ"
        },
        {
          "text": "Аутсорсинг HR-взагалі не використовується",
          "value": 0,
          "recommendation": "Розглянути доцільність передачі рутинних або технічних HR-процесів зовнішнім партнерам для оптимізації роботи підрозділу"
        }
      ]
    },
    {
      "id": "4.8.",
      "criterion": "Відповідність структури кадрового підрозділу організації кількості працівників та організаційний структурі",
      "text": "Чи використовуються інформаційні системи в роботі кадрової служби?",
      "options": [
        {
          "text": "Так, добре налагоджена система",
          "value": 3,
          "recommendation": "Продовжувати оптимізувати та інтегрувати HR-ІТ-систему для аналітики та прогнозування потреб у персоналі"
        },
        {
          "text": "Частково використовуються",
          "value": 2,
          "recommendation": "Розширити функціонал існуючих ІТ-систем та забезпечити їх комплексне застосування  для управління персоналом"
        },
        {
          "text": "Планується впровадити",
          "value": 1,
          "recommendation": "Прискорити впровадження HR-ІТ-системи для автоматизації процесів підбору, навчання та оцінки персоналу"
        },
        {
          "text": "Ні, і не планується",
          "value": 0,
          "recommendation": "Оцінити вигоди від автоматизації HR-процесів та розглянути можливості впровадження хоча б базової інформаційної системи для кадрового обліку"
        }
      ]
    },
    {
      "id": "4.9.",
      "criterion": "Відповідність структури кадрового підрозділу організації кількості працівників та організаційний структурі",
      "text": "Чи використовуються  штучний інтелект в роботі кадрової служби?",
      "options": [
        {
          "text": "Так, активно впроваджується",
          "value": 3,
          "recommendation": "Продовжити інтеграцію ШІ для прогнозування потреб у персоналі, аналізу ефективності та персоналізованого навчання"
        },
        {
          "text": "Частково впроваджується",
          "value": 2,
          "recommendation": "Розширити використання ШІ у рекрутингу, оцінюванні компетенцій та плануванні розвитку персоналу."
        },
        {
          "text": "Планується впровадити",
          "value": 1,
          "recommendation": "Пріоритетно розробити стратегію впровадження ШІ для автоматизації рутинних HR-процесів і аналітики."
        },
        {
          "text": "Ні, і не планується",
          "value": 0,
          "recommendation": "Оцінити потенційні переваги ШІ в HR та розглянути хоча б часткову автоматизацію ключових процесів"
        }
      ]
    },
    {
      "id": "4.10.",
      "criterion": "Відповідність структури кадрового підрозділу організації кількості працівників та організаційний структурі",
      "text": "Яким є рівень сформованості цифрових навичок у співробітників кадрової служби?",
      "options": [
        {
          "text": "Високий, проводиться навчання",
          "value": 3,
          "recommendation": "Підтримувати та розширювати програми навчання, інтегруючи нові цифрові інструменти для HR-аналітики та автоматизації процесів"
        },
        {
          "text": "Середній, проводиться навчання",
          "value": 2,
          "recommendation": "Посилити навчання персоналу з фокусом на сучасні HR-технології та цифрову аналітику для підвищення ефективності роботи HR-підрозділу"
        },
        {
          "text": "Низький, планується навчання",
          "value": 1,
          "recommendation": "Запровадити план розвитку цифрових навичок, почавши з ключових інструментів для рекрутингу, аналітики та автоматизації"
        },
        {
          "text": "Питання не аналізувалось",
          "value": 0,
          "recommendation": "Періодично оцінювати цифрову компетентність працівників HR-підрозділу, щоб запобігти відставанню від сучасних технологій"
        }
      ]
    },
    {
      "id": "5.1.",
      "criterion": "Якісний аналіз інформаційних HRM-систем.",
      "text": "Чи використовується HRM-система для кадрового обліку персоналу?",
      "options": [
        {
          "text": "Використовується повнофункціональна HRM-система (KPI, аналітика, облік, управління талантами тощо). Інтегрована в інші системи управління.",
          "value": 3,
          "recommendation": "Регулярно проводити аудит та аналіз ефективності HRМ-систем оптимізуючи процеси та інтеграцію з іншими корпоративними платформами"
        },
        {
          "text": "Використовується HRМ-система з базовими функціями обліку та частковим використанням аналітики або планування.",
          "value": 2,
          "recommendation": "Розширити функціонал HRМ-системи для покриття аналітики, планування та управління талантами, щоб підвищити стратегічну її цінність. Налаштувати дашборди для аналізу плинності кадрів, часу закриття вакансій, зокрема внутрішніми кандидатами"
        },
        {
          "text": "Використовується базова облікова система, але лише для адміністративного обліку.",
          "value": 1,
          "recommendation": "Впровадити модулі для аналітики та КРІ, щоб перетворити систему з чисто адміністративної на інструмент стратегічного управління персоналом"
        },
        {
          "text": "Не використовується жодна HRM-система, облік ведеться вручну (Excel, паперово).",
          "value": 0,
          "recommendation": "Впровадити сучасну HRM-систему для автоматизації обліку, аналітики та управління персоналом."
        }
      ]
    },
    {
      "id": "5.2.",
      "criterion": "Якісний аналіз інформаційних HRM-систем.",
      "text": "Чи ведеться автоматизована кадрова аналітика?",
      "options": [
        {
          "text": "HR-аналітика добре розвинена, формуються дашборди, аналізується ефективність персоналу, прогнозується плинність кадрів.",
          "value": 3,
          "recommendation": "Проводити регулярний аудит показників, впроваджувати прогностичні моделі для підвищення точності управлінських рішень"
        },
        {
          "text": "Ведеться ключова аналітика, формуються звіти, є часткова інтеграція з іншими інформаційними системами.",
          "value": 2,
          "recommendation": "Розширити інтеграцію з іншими системами та впровадити автоматизовані дашборди для стратегічного аналізу персоналу"
        },
        {
          "text": "Ведеться мінімальна аналітика в Excel",
          "value": 1,
          "recommendation": "Модернізувати процес кадрової аналітики, запровадивши базову HRМ-систему  для автоматизації збору та обробки даних спочатку для обліку кадрів, далі – для рекрутингу та навчання"
        },
        {
          "text": "Не ведеться жодна аналітика або ведеться вручну",
          "value": 0,
          "recommendation": "Впровадити HRIS для автоматизованого збору, обробки та аналізу даних по персоналу."
        }
      ]
    },
    {
      "id": "5.3.",
      "criterion": "Якісний аналіз інформаційних HRM-систем.",
      "text": "Яким є рівень автоматизації процесу пошуку персоналу? Applicant Tracking Systems (ATS)",
      "options": [
        {
          "text": "Використовується поліфункціональна ATS з чат-ботами, аналітикою та ін.",
          "value": 3,
          "recommendation": "Оптимізувати ATS-систему  та інтегрувати додаткові аналітичні модулі для прогнозування ефективності найму та підвищення кандидатського досвіду"
        },
        {
          "text": "Використовуються ATS для базових потреб",
          "value": 2,
          "recommendation": "Розширити функціонал ATS-системи, додавши аналітику, автоматизовані комунікації та інтеграцію з іншими  HRМ-системами"
        },
        {
          "text": "Використовуються зовнішні сервіси, платформи без ATS",
          "value": 1,
          "recommendation": "Впровадити базову ATS для централізації даних кандидатів і автоматизації ключових етапів рекрутингу"
        },
        {
          "text": "Процес пошуку не автоматизовано, використовуються електронна пошта або Excel",
          "value": 0,
          "recommendation": "Впровадити базову ATS або хоча б базову цифрову систему для обліку кандидатів і відстеження процесу найму"
        }
      ]
    },
    {
      "id": "5.4.",
      "criterion": "Якісний аналіз інформаційних HRM-систем.",
      "text": "Яким є рівень автоматизації процесів відбору персоналу?",
      "options": [
        {
          "text": "Відбір повністю автоматизований (системи оцінки soft/hard skills, оцінка СV, відеоінтерв’ю)",
          "value": 3,
          "recommendation": "Оптимізувати інтеграцію аналітичних систем з іншими HRМ для прогнозування успішності кандидатів і підвищення якості підбору"
        },
        {
          "text": "Використовується система з автоматизованими тестами, анкетами, шаблонами оцінки кандидатів",
          "value": 2,
          "recommendation": "Розширити автоматизацію, додавши оцінку soft skills, відеоінтер’ю та аналітику результатів відбору"
        },
        {
          "text": "Частково використовуються онлайн-опитування, тестування",
          "value": 1,
          "recommendation": "Впровадити комплексну ATS або модулі автоматизованого оцінювання для стандартизації процесу."
        },
        {
          "text": "Відбір персоналу ведеться вручну",
          "value": 0,
          "recommendation": "Автоматизувати процес відбору через базові цифрові інструменти (ATS, онлайн-тести, електронний облік кандидатів)"
        }
      ]
    },
    {
      "id": "5.5.",
      "criterion": "Якісний аналіз інформаційних HRM-систем.",
      "text": "Чи використовуються інформаційні системи для управління процесом розвитку персоналу?",
      "options": [
        {
          "text": "Використовується поліфункіональна LMS/PMS (Learning Management Systems/ Performance Management Systems) з оцінкою ефективності навчання, планами розвитку та зворотнім зв’язком.",
          "value": 3,
          "recommendation": "Поглибити аналітику ефективності навчання та інтегрувати з HRM для прогнозування розвитку талантів."
        },
        {
          "text": "Використовуються LMS або PMS із каталогом курсів, планами розвитку",
          "value": 2,
          "recommendation": "Розширити функціонал системи, додавши оцінку ефективності навчання та персоналізовані плани розвитку"
        },
        {
          "text": "Є окремі курси, але немає системи навчання",
          "value": 1,
          "recommendation": "Впровадити централізовану LMS/PMS для структурованого управління навчанням та розвитком персоналу."
        },
        {
          "text": "Навчання не структуроване, LMS/PMS  не використовується",
          "value": 0,
          "recommendation": "Розробити і впровадити цифрову систему управління розвитком персоналу з каталогом курсів, планами розвитку та зворотним зв’язком"
        }
      ]
    },
    {
      "id": "5.6.",
      "criterion": "Якісний аналіз інформаційних HRM-систем.",
      "text": "Чи використовуються інформаційні системи для аналізування рівня задоволеності працівників?",
      "options": [
        {
          "text": "Використовується платформа інтегрована з іншими інформаційними системами з регулярними опитуваннями та рекомендаціями.",
          "value": 3,
          "recommendation": "Поглибити аналітику рівня задоволеності працівників та використовувати результати для прогнозування ризиків плинності та планування розвитку персоналу"
        },
        {
          "text": "Використовуються платформа для опитувань",
          "value": 2,
          "recommendation": "Розширити функціонал інформаційної системи для аналізування рівня задоволеності працівників, додавши інтеграцію з HRМ-системою та автоматизовані рекомендації для підвищення задоволеності"
        },
        {
          "text": "Проводяться разові опитування через Google-форму чи письмові анкети",
          "value": 1,
          "recommendation": "Впровадити регулярні онлайн-опитування рівня задоволеності працівників з автоматизованою обробкою та аналітикою для формування дієвих висновків"
        },
        {
          "text": "Опитування не проводяться",
          "value": 0,
          "recommendation": "Створити регулярну систему опитувань рівня задоволеності працівників через цифрову платформу та інтегрувати її з HR-аналітикою"
        }
      ]
    },
    {
      "id": "5.7.",
      "criterion": "Якісний аналіз інформаційних HRM-систем.",
      "text": "Чи використовуються інформаційні системи для розвитку талантів?",
      "options": [
        {
          "text": "Використовуються повна система розвитку талантів (оцінка, розвиток, індивідуальні траєкторії)",
          "value": 3,
          "recommendation": "Розширювати аналітику ефективності програм для розвитку талантів та інтегрувати результати з плануванням кар’єрних траєкторій"
        },
        {
          "text": "Використовуються програми оцінки потенціалу працівників, планування розвитку кар’єри",
          "value": 2,
          "recommendation": "Впровадити комплексну систему управління талантами для автоматизації оцінки, розвитку та формування індивідуальних траєкторій працівників"
        },
        {
          "text": "Є окремі програми розвитку",
          "value": 1,
          "recommendation": "Створити структуровану систему управління талантами з регулярною оцінкою та персоналізованими планами розвитку"
        },
        {
          "text": "Не використовуються",
          "value": 0,
          "recommendation": "Запровадити цифрову платформу для розвитку талантів з оцінкою потенціалу, плануванням кар’єрних траєкторій та моніторингом ефективності"
        }
      ]
    },
    {
      "id": "5.8.",
      "criterion": "Якісний аналіз інформаційних HRM-систем.",
      "text": "Чи використовуються інформаційні системи для онбордингу?",
      "options": [
        {
          "text": "Онбординг повністю автоматизовано (трекінг, зворотній зв'язок, аналітика)",
          "value": 3,
          "recommendation": "Оптимізувати аналітику адаптації та інтегрувати з подальшим розвитком і навчанням працівників."
        },
        {
          "text": "Використовуються онбординг-платформа або відповідний модуль в HRM-системі",
          "value": 2,
          "recommendation": "Розширити функціонал системи для трекінгу прогресу, зворотного зв’язку та інтеграції з LMS/PMS."
        },
        {
          "text": "Є окремі інструкції, без системи",
          "value": 1,
          "recommendation": "Запровадити цифрову платформу для онбордингу з автоматизацією ключових процесів і збиранням зворотного зв’язку"
        },
        {
          "text": "Не використовуються",
          "value": 0,
          "recommendation": "Створити систематизовану онбординг програму з автоматизованим відстеженням прогресу та аналітикою адаптації нових співробітників"
        }
      ]
    },
    {
      "id": "5.9.",
      "criterion": "Якісний аналіз інформаційних HRM-систем.",
      "text": "Чи використовуються інформаційні системи для оцінювання ефективності персоналу?",
      "options": [
        {
          "text": "Використовуються інтегрована система оцінки (КРІ, 360 градусів, OKR) з метриками",
          "value": 3,
          "recommendation": "Поглибити аналітику результатів оцінювання ефективності персоналу та інтегрувати з розвитком талантів і плануванням навчання"
        },
        {
          "text": "Використовуються оцінки (КРІ, 360 градусів, OKR) без автоматизації аналітики",
          "value": 2,
          "recommendation": "Автоматизувати збір та обробку даних для оперативного аналізу та прийняття рішень."
        },
        {
          "text": "Оцінка проводиться вручну раз на рік (наприклад, КРІ)",
          "value": 1,
          "recommendation": "Впровадити систематизовану цифрову платформу для регулярного моніторингу та зворотного зв’язку."
        },
        {
          "text": "Не використовуються, оцінка не проводиться",
          "value": 0,
          "recommendation": "Розробити структуровану систему оцінки ефективності персоналу з цифровою підтримкою та регулярним аналізом"
        }
      ]
    },
    {
      "id": "5.10.",
      "criterion": "Якісний аналіз інформаційних HRM-систем.",
      "text": "Якою є ступінь використання штучного інтелекту (ШІ) в HR-процесах?",
      "options": [
        {
          "text": "ШІ інтегровано в усі ключові HR-процеси",
          "value": 3,
          "recommendation": "Розвивати прогнозну аналітику та адаптивні моделі управління персоналом на основі даних ШІ."
        },
        {
          "text": "ШІ використовується в кількох процесах (відбір, аналітика залученості, навчання)",
          "value": 2,
          "recommendation": "Розширити застосування ШІ на інші HR-функції, інтегрувати аналітику та автоматизацію процесів."
        },
        {
          "text": "Окремі випадки використання (чат-бот, аналіз CV та ін.)",
          "value": 1,
          "recommendation": "Систематизувати та масштабувати використання ШІ, включивши його в основні HR-процеси (відбір, навчання, розвиток)."
        },
        {
          "text": "Не використовуються",
          "value": 0,
          "recommendation": "Впровадити базові інструменти ШІ для автоматизації рутинних HR-процесів та підвищення точності прийняття рішень"
        }
      ]
    },
    {
      "id": "6.1.",
      "criterion": "Ефективність процесів пошуку персоналу",
      "text": "Чи є окремий підрозділ рекрутингу?",
      "options": [
        {
          "text": "Так",
          "value": 3,
          "recommendation": "Оптимізувати процеси рекрутингу та впровадити аналітику для прогнозування потреб у персоналі та скорочення часу підбору"
        },
        {
          "text": "Є окремий фахівець в HR-підрозділі",
          "value": 2,
          "recommendation": "Оптимізувати процеси рекрутингу та впровадити аналітику для прогнозування потреб у персоналі та скорочення часу підбору"
        },
        {
          "text": "Ректрутингом займається фахівець без спеціалізації",
          "value": 1,
          "recommendation": "Впровадити структуровані процеси рекрутингу та навчання  HR-фахівця спеціалізованим методикам підбору"
        },
        {
          "text": "Функцію виконують керівники",
          "value": 0,
          "recommendation": "Розглянути можливості виділення HR-фахівця  для централізованого та ефективного пошуку персоналу"
        }
      ]
    },
    {
      "id": "6.2.",
      "criterion": "Ефективність процесів пошуку персоналу",
      "text": "Який відсоток вакансій закривається зовнішніми джерелами?",
      "options": [
        {
          "text": "Більше 80%",
          "value": 3,
          "recommendation": "Продовжити використання ефективних зовнішніх каналів пошуку кандидатів, водночас розвивати внутрішні джерела, щоб зменшити витрати та скоротити час підбору"
        },
        {
          "text": "51-80%",
          "value": 2,
          "recommendation": "Оптимізувати комбінацію зовнішніх і внутрішніх каналів підбору кандидатів для підвищення швидкості закриття вакансій"
        },
        {
          "text": "20-50%",
          "value": 1,
          "recommendation": "Активізувати роботу з зовнішніми платформами, агентствами та соціальними мережами для залучення більшого числа кандидатів"
        },
        {
          "text": "Менше 20%",
          "value": 0,
          "recommendation": "Розробити стратегію активного залучення зовнішніх кандидатів через професійні мережі, рекрутингові агентства та онлайн платформи"
        }
      ]
    },
    {
      "id": "6.3.",
      "criterion": "Ефективність процесів пошуку персоналу",
      "text": "Які канали пошуку використовуються? (соцмережі, кадрові агентства, job-сайти, рекомендації)",
      "options": [
        {
          "text": "Більше 5 каналів з системним аналізом ефективності",
          "value": 3,
          "recommendation": "Продовжити аналізувати ефективність каналів пошуку персоналу і оптимізувати бюджет на найрезультативніші джерела"
        },
        {
          "text": "4-5 каналів",
          "value": 2,
          "recommendation": "Впровадити системний моніторинг ефективності кожного каналу пошуку персоналу та розглянути додаткові джерела для підвищення якості підбору"
        },
        {
          "text": "2-3 канали",
          "value": 1,
          "recommendation": "Розширити кількість каналів пошуку персоналу та почати збирати дані для аналізу ефективності."
        },
        {
          "text": "Лише 1 канал",
          "value": 0,
          "recommendation": "Активно додавати нові канали пошуку персоналу та впроваджувати базовий моніторинг результативності."
        }
      ]
    },
    {
      "id": "6.4.",
      "criterion": "Ефективність процесів пошуку персоналу",
      "text": "Який відсоток вакансій закривається за рахунок внутрішніх джерел?",
      "options": [
        {
          "text": "Більше 80%",
          "value": 3,
          "recommendation": "Підтримувати і масштабувати програми внутрішньої мобільності та кар’єрного розвитку, щоб утримувати високий рівень залучення працівників"
        },
        {
          "text": "20-50%",
          "value": 2,
          "recommendation": "Впроваджувати програми внутрішніх ротацій та програми рекомендацій   для підвищення частки внутрішніх кандидатів"
        },
        {
          "text": "Менше 20%",
          "value": 1,
          "recommendation": "Розробити стратегію внутрішньої мобільності та просувати внутрішні можливості серед працівників для підвищення частки внутрішніх кандидатів."
        },
        {
          "text": "Внутрішні ресурси не використовуються",
          "value": 0,
          "recommendation": "Запровадити базові механізми внутрішньої ротації, кар’єрні траєкторії та програми рекомендацій  для підвищення частки внутрішніх кандидатів"
        }
      ]
    },
    {
      "id": "6.5.",
      "criterion": "Ефективність процесів пошуку персоналу",
      "text": "Чи погоджуються вакансії з керівниками структурних підрозділів?",
      "options": [
        {
          "text": "Керівники беруть активну участь у формуванні вимог до кандидатів",
          "value": 3,
          "recommendation": "Підтримувати рівень взаємодії з керівниками структурних підрозділів при формуванні вимог до кандидатів та документувати узгоджені профілі вакансій для подальшого аналізу"
        },
        {
          "text": "Вакансії погоджуються з керівниками",
          "value": 2,
          "recommendation": "Посилити співпрацю з керівниками підрозділів при формуванні вимог до кандидатів, наприклад, через регулярні зустрічі для уточнення вимог"
        },
        {
          "text": "Відбувається формальне погодження",
          "value": 1,
          "recommendation": "Впровадити стандартизовані інструменти для активної участі керівників підрозділів у визначенні критеріїв відбору кандидатів"
        },
        {
          "text": "Не погоджуються, рішення приймаються централізовано",
          "value": 0,
          "recommendation": "Розробити процес залучення керівників до формування профілів вакансій для підвищення відповідності кандидатів потребам підрозділів"
        }
      ]
    },
    {
      "id": "6.6.",
      "criterion": "Ефективність процесів пошуку персоналу",
      "text": "Чи застосовуються підходи хедхантингу при пошуку персоналу?",
      "options": [
        {
          "text": "Системний підхід, активний пошук",
          "value": 3,
          "recommendation": "Підтримувати та вдосконалювати аналітику ефективності хедхантингу, інтегрувати нові канали пошуку кандидатів та автоматизацію"
        },
        {
          "text": "Регулярне застосування для ключових посад",
          "value": 2,
          "recommendation": "Розширити хедхантинг на інші важливі позиції та формалізувати цей процес"
        },
        {
          "text": "Разові випадки",
          "value": 1,
          "recommendation": "Запровадити системний підхід та навчити HR-команду методам активного пошуку талантів."
        },
        {
          "text": "Не використовується",
          "value": 0,
          "recommendation": "Впровадити хедхантинг для стратегічних і ключових позицій та розробити план активного пошуку кандидатів"
        }
      ]
    },
    {
      "id": "6.7.",
      "criterion": "Ефективність процесів пошуку персоналу",
      "text": "Чи є в організації власний кар’єрний портал?",
      "options": [
        {
          "text": "Поліфункціональний інтегрований портал",
          "value": 3,
          "recommendation": "Підтримувати та вдосконалювати аналітику користувачів кар’єрного порталу, персоналізацію та інтеграцію з іншими HRM-системами."
        },
        {
          "text": "Є окремий портал чи модуль HRM",
          "value": 2,
          "recommendation": "Розширити функціонал кар’єрного порталу для внутрішнього та зовнішнього ректутингу, а також інтегрувати його з іншими системами управління персоналом"
        },
        {
          "text": "Є розділ на сайті з переліком вакансій",
          "value": 1,
          "recommendation": "Трансформувати розділ сайту з переліком вакансій у функціональний кар’єрний портал з можливістю подачі заявок та відстеження статусу кандидатів"
        },
        {
          "text": "Відсутній",
          "value": 0,
          "recommendation": "Створити власний кар’єрний портал для автоматизації рекрутингу та розвитку внутрішніх талантів."
        }
      ]
    },
    {
      "id": "6.8.",
      "criterion": "Ефективність процесів пошуку персоналу",
      "text": "Чи аналізується профіль посади для формування оголошення про вакантну посаду?",
      "options": [
        {
          "text": "Проводиться глибокий аналіз профілю",
          "value": 3,
          "recommendation": "Підтримувати та регулярно оновлювати методику аналізу профілів для підвищення точності відбору та прогнозування ефективності кандидатів"
        },
        {
          "text": "Є стандартизований підхід до створенню профілю посади",
          "value": 2,
          "recommendation": "Впровадити елементи гнучкості та адаптації під специфіку конкретних вакансій."
        },
        {
          "text": "Частковий аналіз під час узгодження вакансії",
          "value": 1,
          "recommendation": "Розробити системний процес оцінки профілю посади перед формуванням оголошення."
        },
        {
          "text": "Використовуються шаблони",
          "value": 0,
          "recommendation": "Перейти до структурованого аналізу профілю посади для підвищення відповідності кандидатів вимогам."
        }
      ]
    },
    {
      "id": "6.9.",
      "criterion": "Ефективність процесів пошуку персоналу",
      "text": "Який відсоток кандидатів проходить етапи відбору?",
      "options": [
        {
          "text": "Більше 80%, оптимізація процесу для зменшення витрат",
          "value": 3,
          "recommendation": "Оптимізувати критерії та етапи відбору, щоб зменшити ресурси на низькоефективні етапи."
        },
        {
          "text": "50-80%, регулярно аналізується воронка відбору",
          "value": 2,
          "recommendation": "Підтримувати аналітику воронки та коригувати процеси для підвищення якості кандидатів."
        },
        {
          "text": "Менше 50%",
          "value": 1,
          "recommendation": "Покращити методи залучення та попередньої оцінки кандидатів для зменшення відсіву на ранніх етапах"
        },
        {
          "text": "Надмірна втрата кандидатів (більше 80%)",
          "value": 0,
          "recommendation": "терміново переглянути всі етапи відбору, спростити процес та підвищити комунікацію з кандидатами."
        }
      ]
    },
    {
      "id": "6.10.",
      "criterion": "Ефективність процесів пошуку персоналу",
      "text": "Чи сформовано бренд роботодавця?",
      "options": [
        {
          "text": "Робота над брендом є системною (присутність у рейтингах, активність на ярмарках, амбасадори та ін.)",
          "value": 3,
          "recommendation": "Підтримувати та поглиблювати ініціативи по інтеграції бренду роботодавця у всі HR-процеси та комунікації"
        },
        {
          "text": "Працює EVP",
          "value": 2,
          "recommendation": "Посилити EVP через соцмережі, внутрішні канали та зовнішні заходи для залучення кандидатів"
        },
        {
          "text": "Є базові матеріали на сайті та в соц. мережах",
          "value": 1,
          "recommendation": "Розробити комплексну стратегію бренду роботодавця, EVP та системно просувати її зовні і всередині компанії."
        },
        {
          "text": "Робота над брендом не проводиться",
          "value": 0,
          "recommendation": "Терміново розпочати формування бренду роботодавця, визначивши EVP та канали комунікації."
        }
      ]
    },
    {
      "id": "7.1.",
      "criterion": "Ефективність процесів відбору персоналу",
      "text": "Ким здійснюється процес відбору?",
      "options": [
        {
          "text": "Команда з рекрутера (фахівця з підбору кадрів), керівника підрозділу",
          "value": 3,
          "recommendation": "Підтримувати спільну роботу та впроваджувати стандартизовані методики оцінки кандидатів для підвищення точності відбору."
        },
        {
          "text": "Фахівець з підбору кадрів",
          "value": 2,
          "recommendation": "Розширити взаємодію з керівниками підрозділів для кращого розуміння потреб і підвищення якості відбору."
        },
        {
          "text": "Фахівець HR без спеціалізації",
          "value": 1,
          "recommendation": "Забезпечити навчання HR у методиках підбору та оцінки кандидатів, щоб покращити ефективність процесу."
        },
        {
          "text": "Випадкові особи, керівники підрозділів",
          "value": 0,
          "recommendation": "Впровадити централізований та стандартизований процес відбору з участю кваліфікованого рекрутера."
        }
      ]
    },
    {
      "id": "7.2.",
      "criterion": "Ефективність процесів відбору персоналу",
      "text": "Чи проводить аналізування професійних компетентностей кандидатів?",
      "options": [
        {
          "text": "Застосовується системний підхід з кейс-інтерв’ю, аналізом компетентностей (soft/hard skills), тестами з фаху",
          "value": 3,
          "recommendation": "Підтримувати і вдосконалювати методики оцінки, інтегрувати дані у HRM-систему для аналітики та прогнозування успішності."
        },
        {
          "text": "Застосовуються тільки тести або завдання з фаху (hard skills)",
          "value": 2,
          "recommendation": "Додати оцінку soft skills та поведінкових компетентностей для комплексного підходу."
        },
        {
          "text": "Аналізуються тільки формальні ознаки (досвід, дипломи)",
          "value": 1,
          "recommendation": "Впровадити структуровані методики оцінки компетентностей та практичні кейси для підвищення точності відбору."
        },
        {
          "text": "Не аналізуються",
          "value": 0,
          "recommendation": "Створити стандартизовану систему оцінки професійних компетентностей кандидатів із тестами, інтерв’ю та кейс-завданнями."
        }
      ]
    },
    {
      "id": "7.3.",
      "criterion": "Ефективність процесів відбору персоналу",
      "text": "Чи проводить аналізування соціальних компетентностей (софт скілів) кандидатів?",
      "options": [
        {
          "text": "Системно використовуються спеціальні методики аналізу соціальних компетентностей",
          "value": 3,
          "recommendation": "Продовжувати інтегрувати результати в HRM-систему для аналітики та розвитку персоналу."
        },
        {
          "text": "Використовуються стандартні питання, рольові ситуації",
          "value": 2,
          "recommendation": "Впровадити формалізовані методики оцінки соціальних компетентностей    кандидатів та психометричні тести для більш об’єктивної оцінки"
        },
        {
          "text": "Робляться загальні висновки за результатами співбесіди",
          "value": 1,
          "recommendation": "Систематизувати підхід до аналізування соціальних компетентностей кандидатів, додавши стандартизовані інструменти їх оцінки"
        },
        {
          "text": "Не аналізуються",
          "value": 0,
          "recommendation": "Запровадити оцінку soft skills кандидатів за допомогою тестів, кейсів та структурованих інтерв’ю для підвищення якості відбору"
        }
      ]
    },
    {
      "id": "7.4.",
      "criterion": "Ефективність процесів відбору персоналу",
      "text": "Чи використовуються психометричні та ситуаційні тести при відборі працівників?",
      "options": [
        {
          "text": "Застосовується комплексна оцінка (ситуаційні, психометричні, етичні, мотиваційні тести)",
          "value": 3,
          "recommendation": "Інтегрувати результати психометричних та ситуаційних тести тестів на soft skills у HR-аналітику та плани розвитку персоналу для стратегічного управління талантами"
        },
        {
          "text": "Використовуються регулярно мінімум 2 тести (DISC, MBTI та ін.)",
          "value": 2,
          "recommendation": "Розширити набір тестів для комплексної оцінки компетентностей та розвитку кар’єрних траєкторій."
        },
        {
          "text": "Використовуються не системно 1 тип тесту",
          "value": 1,
          "recommendation": "Запровадити системний підхід з декількома типами психометричних та ситуаційних тестів на soft skills для підвищення об’єктивності відбору кандидатів"
        },
        {
          "text": "Не застосовуються",
          "value": 0,
          "recommendation": "Впровадити базові психометричні та ситуаційні тести для підвищення ефективності процесу відбору"
        }
      ]
    },
    {
      "id": "7.5.",
      "criterion": "Ефективність процесів відбору персоналу",
      "text": "Хто залучається до інтерв’ю, аналізу резюме кандидатів?",
      "options": [
        {
          "text": "Спеціальна комісія з залученням працівників підрозділу",
          "value": 3,
          "recommendation": "Інтегрувати отримані оцінки інтерв’ю та аналіз резюме в HR-аналітику для підвищення точності відбору та адаптації нового працівника"
        },
        {
          "text": "Комісія з представників HR, керівників організації, підрозділу",
          "value": 2,
          "recommendation": "Формалізувати процес оцінки та стандартизувати критерії для більш об’єктивного відбору"
        },
        {
          "text": "Представник HR та керівник підрозділу без регламентації",
          "value": 1,
          "recommendation": "Запровадити чіткі правила проведення інтерв’ю та аналізу резюме для підвищення прозорості та ефективності відбору"
        },
        {
          "text": "Лише одна особа: керівник підрозділу або  HR",
          "value": 0,
          "recommendation": "Розширити коло учасників інтерв’ю, щоб забезпечити багатосторонню оцінку компетентностей та культури кандидата"
        }
      ]
    },
    {
      "id": "7.6.",
      "criterion": "Ефективність процесів відбору персоналу",
      "text": "Чи проводиться прозорий конкурс на заміщення вакантних посад?",
      "options": [
        {
          "text": "Конкурс проводиться прозоро, процедура конкурсу регламентована у внутрішніх документах, застосовується багаторівнева система оцінки кандидатів.",
          "value": 3,
          "recommendation": "Підтримувати та регулярно вдосконалювати процедури конкурсу на заміщення вакантних посад, впроваджувати аналітику їх ефективності"
        },
        {
          "text": "Відкрите оголошення конкурсу, є процедура від бору",
          "value": 2,
          "recommendation": "Формалізувати багаторівневу систему оцінки при проведенні конкурсу на заміщення вакантних посад та інтегрувати її в HR-аналітику"
        },
        {
          "text": "Формально процедура конкурсу регламентована у внутрішніх документах, однак відбір відбувається стихійно",
          "value": 1,
          "recommendation": "Розробити чіткі процедури конкурсу, стандартизовані критерії оцінки при проведенні конкурсу на заміщення вакантних посад та контроль за дотриманням правил"
        },
        {
          "text": "Призначення без конкурсу",
          "value": 0,
          "recommendation": "Впровадити формалізовану процедуру відкритого конкурсу з чіткими критеріями відбору та багаторівневою оцінкою кандидатів для підвищення прозорості та об’єктивності призначень"
        }
      ]
    },
    {
      "id": "7.7.",
      "criterion": "Ефективність процесів відбору персоналу",
      "text": "Якою є плинність кадрів в організації?",
      "options": [
        {
          "text": "Менше 10%",
          "value": 3,
          "recommendation": "Підтримувати існуючі практики утримання персоналу та впроваджувати програми розвитку для збереження стабільності"
        },
        {
          "text": "10 – 20%",
          "value": 2,
          "recommendation": "Аналізувати причини звільнень та посилювати програми залучення та мотивації працівників."
        },
        {
          "text": "20 – 40%",
          "value": 1,
          "recommendation": "Впроваджувати системні програми адаптації, розвитку та мотивації персоналу, переглянути умови праці та корпоративну культуру"
        },
        {
          "text": "Більше 40%",
          "value": 0,
          "recommendation": "Провести аудит HR-процесів, розробити стратегічний план утримання ключових кадрів та зменшення плинності"
        }
      ]
    },
    {
      "id": "7.8.",
      "criterion": "Ефективність процесів відбору персоналу",
      "text": "Чи існує стандартизований алгоритм відбору персоналу організації?",
      "options": [
        {
          "text": "Так, є задокументований алгоритм (процедура), яка використовується по усій організації.",
          "value": 3,
          "recommendation": "Підтримувати та періодично оновлювати алгоритм відбору персоналу організації з урахуванням змін у бізнес-бізнес процесах та ринку праці"
        },
        {
          "text": "Є задокументований алгоритм (процедура), яка частково використовується для окремих категорій працівників.",
          "value": 2,
          "recommendation": "Розширити застосування алгоритму відбору персоналу організації на всі ключові категорії працівників і забезпечити його дотримання"
        },
        {
          "text": "Існує задокументований алгоритм (процедура), яка не дотримується на практиці",
          "value": 1,
          "recommendation": "Провести аудит використання алгоритму відбору персоналу, провести навчання керівників та HR, забезпечити контроль за дотриманням процедури"
        },
        {
          "text": "Рішення приймаються ситуативно, процедура не задокументована",
          "value": 0,
          "recommendation": "Розробити та затвердити єдиний алгоритм відбору персоналу з чіткими етапами та критеріями."
        }
      ]
    },
    {
      "id": "7.9.",
      "criterion": "Ефективність процесів відбору персоналу",
      "text": "Чи фіксується зворотний зв’язок кандидатам за результатами проходження етапів відбору?",
      "options": [
        {
          "text": "Зворотний зв’язок надається усім кандидатам на усіх етапах відбору",
          "value": 3,
          "recommendation": "Підтримувати практику зворотного зв’язку за результатами проходження етапів відбору та вдосконалювати її через стандартизовані  шаблони і цифрові інструменти для економії часу"
        },
        {
          "text": "Зворотний зв’язок надається більшості кандидатів або на окремі посади",
          "value": 2,
          "recommendation": "Розширити практику надання зворотного зв’язку до всіх кандидатів, щоб підвищити привабливість бренду роботодавця"
        },
        {
          "text": "Зворотний зв’язок надається лише кандидатам, які  пройшли фінальний етап відбору",
          "value": 1,
          "recommendation": "Запровадити обов’язкове інформування всіх кандидатів, щоб підвищити прозорість і лояльність до компанії"
        },
        {
          "text": "Зворотний зв’язок кандидатам не надається",
          "value": 0,
          "recommendation": "Розробити процедуру та стандарти для надання зворотного зв’язку на всіх етапах відбору."
        }
      ]
    },
    {
      "id": "7.10.",
      "criterion": "Ефективність процесів відбору персоналу",
      "text": "Який середній час закриття вакансій в організації?",
      "options": [
        {
          "text": "Менше 30 днів, процес оптимізовано",
          "value": 3,
          "recommendation": "Підтримувати ефективні практики закриття вакансій та періодично аналізувати вузькі місця для подальшого вдосконалення"
        },
        {
          "text": "30 – 44 днів",
          "value": 2,
          "recommendation": "Впровадити автоматизацію частини процесу відбору та активніше використовувати внутрішні та зовнішні канали пошуку для скорочення часу"
        },
        {
          "text": "45 – 59 днів",
          "value": 1,
          "recommendation": "Оптимізувати етапи відбору, стандартизувати процедури та застосувати ATS/HRM-системи для контролю ефективності"
        },
        {
          "text": "Більше 59 днів або облік не ведеться",
          "value": 0,
          "recommendation": "Запровадити систему моніторингу та аналізу часу закриття вакансій, автоматизувати ключові процеси рекрутингу та стандартизувати алгоритм відбору"
        }
      ]
    },
    {
      "id": "8.1.",
      "criterion": "Аналізування системи адаптації нових працівників",
      "text": "Чи є прописана система онбордингу?",
      "options": [
        {
          "text": "Є детальна програма онбордингу, яка включає план, контроль, відповідальних",
          "value": 3,
          "recommendation": "Регулярно оновлювати програму онбордингу, інтегруючи цифрові інструменти та збираючи зворотний зв’язок новачків"
        },
        {
          "text": "Онбординг проводиться за усталеною практикою, програма не прописана",
          "value": 2,
          "recommendation": "Формалізувати процес онбордингу у вигляді єдиної задокументованої програми з чіткими етапами."
        },
        {
          "text": "Є окремі елементи онбордингу",
          "value": 1,
          "recommendation": "Об’єднати існуючі практики онбордингу в системний алгоритм адаптації з визначенням відповідальних."
        },
        {
          "text": "Відсутня система адаптації",
          "value": 0,
          "recommendation": "Розробити базову програму онбордингу з планом першого місяця роботи та наставництвом."
        }
      ]
    },
    {
      "id": "8.2.",
      "criterion": "Аналізування системи адаптації нових працівників",
      "text": "Чи є система наставництва?",
      "options": [
        {
          "text": "Наставництво є частиною адаптації з чіткою структурою",
          "value": 3,
          "recommendation": "Удосконалювати програму адаптації шляхом оцінки ефективності наставників і залучення їх до навчання новачків"
        },
        {
          "text": "Застосовується практика призначення наставника",
          "value": 2,
          "recommendation": "Розробити стандартизовану програму наставництва з прописаними завданнями та очікуваними результатами"
        },
        {
          "text": "Є поодинокі приклади наставництва за власною ініціативою керівників (працівників)",
          "value": 1,
          "recommendation": "Запровадити офіційну систему наставництва з мотивацією для наставників."
        },
        {
          "text": "Відсутня",
          "value": 0,
          "recommendation": "Створити базову програму наставництва як ключовий інструмент адаптації персоналу."
        }
      ]
    },
    {
      "id": "8.3.",
      "criterion": "Аналізування системи адаптації нових працівників",
      "text": "Чи включений безпосередній керівник працівника у процес онбордингу?",
      "options": [
        {
          "text": "Керівник бере активну участь в онбордингу (планування, зворотний зв'язок, введення у проєкти)",
          "value": 3,
          "recommendation": "Закріпити практику участь в онбордингу як обов’язковий стандарт і поширити на всі підрозділи."
        },
        {
          "text": "Керівник проводить інструктаж",
          "value": 2,
          "recommendation": "Доповнити процес онбордингу регулярним зворотним зв’язком та залученням до командної роботи."
        },
        {
          "text": "Керівник включається формально",
          "value": 1,
          "recommendation": "Створити систему контролю та навчання керівників їх ролі у процесі адаптації."
        },
        {
          "text": "Керівник не бере участі",
          "value": 0,
          "recommendation": "Запровадити обов’язкову участь керівника у програмі онбордингу для максимальної інтеграції"
        }
      ]
    },
    {
      "id": "8.4.",
      "criterion": "Аналізування системи адаптації нових працівників",
      "text": "Чи включений кадровий підрозділ у процес онбордингу?",
      "options": [
        {
          "text": "Кадровий підрозділ забезпечує повну організаційну підтримку онбордингу",
          "value": 3,
          "recommendation": "Розширити практику інтеграції HR у стратегічні ініціативи розвитку нових працівників."
        },
        {
          "text": "Кадровий підрозділ веде адаптаційні зустрічі, консультує",
          "value": 2,
          "recommendation": "Доповнити процес системним моніторингом прогресу новачків і зворотним зв’язком."
        },
        {
          "text": "Кадровий підрозділ здійснює документальний супровід",
          "value": 1,
          "recommendation": "Посилити роль HR через впровадження програм адаптаційної підтримки."
        },
        {
          "text": "Кадровий підрозділ не бере участі",
          "value": 0,
          "recommendation": "Залучити HR до процесу онбордингу як ключового координатора адаптаційних заходів."
        }
      ]
    },
    {
      "id": "8.5.",
      "criterion": "Аналізування системи адаптації нових працівників",
      "text": "Чи ознайомлюють працівника з посадовими обов’язками?",
      "options": [
        {
          "text": "Так, застосовується повне введення у посаду з інструктажем, планом дій очікуваннями",
          "value": 3,
          "recommendation": "Доповнити процес ознайомлення працівника з посадовими обов’язками регулярними зустрічами для відстеження прогресу"
        },
        {
          "text": "Так, застосовується введення у посаду з усними поясненнями",
          "value": 2,
          "recommendation": "Створити письмові інструкції та чек-листи для підвищення чіткості ознайомлення працівників з посадовими обов’язками"
        },
        {
          "text": "Ознайомлення формальне (підпис документів)",
          "value": 1,
          "recommendation": "Перетворити формальність при ознайомленні працівника з посадовими обов’язками на реальне навчання через тренінги та наставництво"
        },
        {
          "text": "Не ознайомлюють",
          "value": 0,
          "recommendation": "Запровадити обов’язкове введення у посаду з ознайомленням працівника з посадовими обов’язками, розробкою плану адаптації та очікувань"
        }
      ]
    },
    {
      "id": "8.6.",
      "criterion": "Аналізування системи адаптації нових працівників",
      "text": "Чи роз’яснюють працівнику зв'язок його професійних цілей та стратегії організації?",
      "options": [
        {
          "text": "Працівника повністю інтегрують у стратегічні цілі через КРІ, OKR",
          "value": 3,
          "recommendation": "Підтримувати регулярний перегляд професійних цілей працівника і коригування їх відповідно до змін стратегії"
        },
        {
          "text": "Керівник пояснює зв’язок функцій зі стратегією",
          "value": 2,
          "recommendation": "Формалізувати процес пояснення зв’язку професійних цілей працівника зі стратегією через індивідуальні плани розвитку та оцінки результатів"
        },
        {
          "text": "Може згадуватись під час адаптації",
          "value": 1,
          "recommendation": "Ввести обов’язковий блок про стратегічні цілі у програму онбордингу."
        },
        {
          "text": "Ні, не передбачено",
          "value": 0,
          "recommendation": "Розробити механізм комунікації стратегічних цілей на рівні підрозділів і працівників."
        }
      ]
    },
    {
      "id": "8.7.",
      "criterion": "Аналізування системи адаптації нових працівників",
      "text": "Чи проводяться неформальні заходи по адаптації працівника у колективі?",
      "options": [
        {
          "text": "Регулярна практика інтегрована у систему управління персоналом",
          "value": 3,
          "recommendation": "Продовжувати практику проведення неформальних заходів по адаптації та доповнювати її зворотним зв’язком від новачків"
        },
        {
          "text": "Плануються епізодично (зустрічі, корпоративи)",
          "value": 2,
          "recommendation": "Запровадити чіткий календар інтеграційних заходів для нових працівників."
        },
        {
          "text": "Іноді проводяться не за планом",
          "value": 1,
          "recommendation": "Зробити неформальні заходи частиною системної програми адаптації."
        },
        {
          "text": "Ні, не проводяться",
          "value": 0,
          "recommendation": "Запровадити прості інтеграційні неформальні заходи, зустрічі або наставницькі сесії для створення сприятливого клімату в колективі"
        }
      ]
    },
    {
      "id": "8.8.",
      "criterion": "Аналізування системи адаптації нових працівників",
      "text": "Скільки відсотків нових працівників звільняються після випробувального терміну?",
      "options": [
        {
          "text": "Менше 10%",
          "value": 3,
          "recommendation": "Підтримувати поточні практики адаптації та посилювати індивідуалізацію онбордингу."
        },
        {
          "text": "11 – 20%",
          "value": 2,
          "recommendation": "Проводити регулярний аналіз причин звільнення та удосконалювати комунікацію очікувань."
        },
        {
          "text": "21 – 30%",
          "value": 1,
          "recommendation": "Запровадити програму наставництва та системний збір зворотного зв’язку від новачків."
        },
        {
          "text": "Більше 30%",
          "value": 0,
          "recommendation": "Переглянути процеси відбору та адаптації, посилити підтримку з боку керівників і HR."
        }
      ]
    },
    {
      "id": "8.9.",
      "criterion": "Аналізування системи адаптації нових працівників",
      "text": "Скільки відсотків нових працівників звільняються після 6-12 місяців роботи?",
      "options": [
        {
          "text": "Менше 10%",
          "value": 3,
          "recommendation": "Зберігати ефективні практики адаптації та впроваджувати додаткові можливості розвитку й кар’єрного росту."
        },
        {
          "text": "11 – 20%",
          "value": 2,
          "recommendation": "Посилити програми утримання персоналу через менторство та індивідуальні плани розвитку."
        },
        {
          "text": "21 – 30%",
          "value": 1,
          "recommendation": "Удосконалити внутрішні комунікації та проводити регулярні опитування задоволеності."
        },
        {
          "text": "Більше 30%",
          "value": 0,
          "recommendation": "Комплексно переглянути процедуру адаптації, умови праці та мотиваційну систему, щоб знизити ризики відтоку кадрів"
        }
      ]
    },
    {
      "id": "8.10.",
      "criterion": "Аналізування системи адаптації нових працівників",
      "text": "Наскільки змінюється рівень продуктивності нових працівників після 3-6 місяців роботи?",
      "options": [
        {
          "text": "Стабільно зростає, що фіксується за допомогою показників ефективності",
          "value": 3,
          "recommendation": "Продовжити практику фіксації рівня продуктивності за допомогою показників ефективності з поєднанням з індивідуальними планами розвитку"
        },
        {
          "text": "Продуктивність зростає, але не фіксується за допомогою показників ефективності",
          "value": 2,
          "recommendation": "Запровадити регулярний моніторинг KPI/OKR для об’єктивної оцінки."
        },
        {
          "text": "Слабкий прогрес",
          "value": 1,
          "recommendation": "Підсилити наставництво, фідбек-сесії та індивідуальні програми розвитку. Запровадити регулярний  моніторинг KPI/OKR для об’єктивної оцінки."
        },
        {
          "text": "Не оцінюється або знижується",
          "value": 0,
          "recommendation": "Запровадити систему вимірювання ефективності й переглянути підходи до онбордингу та мотивації."
        }
      ]
    },
    {
      "id": "9.1.",
      "criterion": "Впровадження систем оцінювання персоналу",
      "text": "Наскільки регулярною є оцінка персоналу?",
      "options": [
        {
          "text": "Оцінка персоналу інтегрована у систему управління та пов’язана  з стратегічними планами організації.",
          "value": 3,
          "recommendation": "Продовжувати інтегрувати оцінку персоналу з бізнес- цілями та використовувати її результати для розвитку ключових талантів"
        },
        {
          "text": "Оцінка персоналу проводиться регулярно раз на рік",
          "value": 2,
          "recommendation": "Відслідковувати регулярність оцінки персоналу та інтегрувати проміжні показники для більш оперативного коригування розвитку працівників"
        },
        {
          "text": "Оцінка персоналу проводиться стихійно",
          "value": 1,
          "recommendation": "Впровадити стандартизовану систему оцінювання персоналу з чітким графіком та регламентом."
        },
        {
          "text": "Оцінка персоналу не проводиться",
          "value": 0,
          "recommendation": "Запровадити базову систему оцінки працівників, почавши з ключових ролей та показників ефективності."
        }
      ]
    },
    {
      "id": "9.2.",
      "criterion": "Впровадження систем оцінювання персоналу",
      "text": "Хто є учасниками оцінювання?",
      "options": [
        {
          "text": "До оцінювання залучено багато рівнів",
          "value": 3,
          "recommendation": "Продовжити застосування багаторівневого підходу до оцінювання. Використовувати результати для комплексного розвитку команди"
        },
        {
          "text": "HR, керівник працівника, колеги",
          "value": 2,
          "recommendation": "Систематизувати процес оцінювання, додавши стандартизовані методики та регулярний зворотний зв’язок"
        },
        {
          "text": "HR та  керівник працівника",
          "value": 1,
          "recommendation": "Розширити залучення колег у процес оцінювання для більшої об’єктивності"
        },
        {
          "text": "Лише HR або керівник працівника",
          "value": 0,
          "recommendation": "Впровадити мультиджерельну оцінку для підвищення точності та прозорості оцінювання працівників."
        }
      ]
    },
    {
      "id": "9.3.",
      "criterion": "Впровадження систем оцінювання персоналу",
      "text": "Чи є в організації ассесмент-центр?",
      "options": [
        {
          "text": "Так, функціонує системно",
          "value": 3,
          "recommendation": "Продовжити системне використання ассесмент-центру та інтегрувати його результати у плани розвитку персоналу"
        },
        {
          "text": "Так, використовується тільки для окремих посад",
          "value": 2,
          "recommendation": "Розширити застосування ассесмент-центру на більшу кількість ключових посад для комплексної оцінки талантів"
        },
        {
          "text": "Планується відкрити",
          "value": 1,
          "recommendation": "Прискорити впровадження ассесмент-центру та забезпечити навчання оцінювачів для якісного запуску."
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Розглянути можливість впровадження ассесмент-центру для системної оцінки компетентностей та розвитку персоналу"
        }
      ]
    },
    {
      "id": "9.4.",
      "criterion": "Впровадження систем оцінювання персоналу",
      "text": "Чи впроваджена система грейдингу посад (працівників)?",
      "options": [
        {
          "text": "Так, функціонує системно, повністю структурована",
          "value": 3,
          "recommendation": "Продовжувати підтримку та оновлення грейдингу для збереження прозорості кар’єрного розвитку та компенсацій"
        },
        {
          "text": "Так, використовується тільки для окремих груп посад (працівників)",
          "value": 2,
          "recommendation": "Розширити систему грейдингу на всі категорії працівників для уніфікованої оцінки та винагороди."
        },
        {
          "text": "Планується впровадити",
          "value": 1,
          "recommendation": "Прискорити розробку та впровадження грейдингу посад з чіткими критеріями для персоналу"
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Розглянути розробку системи грейдингу для структуризації посад, прозорого управління кар’єрою та компенсаційними пакетами"
        }
      ]
    },
    {
      "id": "9.5.",
      "criterion": "Впровадження систем оцінювання персоналу",
      "text": "Чи впроваджена система оцінки 360 градусів?",
      "options": [
        {
          "text": "Так, функціонує системно",
          "value": 3,
          "recommendation": "Продовжувати підтримку та аналіз результатів система оцінки 360 градусів для постійного розвитку компетентностей та підвищення ефективності"
        },
        {
          "text": "Так, використовується тільки для окремих груп посад (працівників)",
          "value": 2,
          "recommendation": "Розширити застосування системи оцінки 360 градусів на усі ключові позиції для комплексного розвитку персоналу"
        },
        {
          "text": "Планується впровадити",
          "value": 1,
          "recommendation": "Прискорити впровадження системи оцінки 360 градусів з чіткими інструкціями та інформуванням всіх учасників"
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Розглянути можливості впровадження  системи оцінки 360 градусів для отримання повного зворотного зв’язку та розвитку співробітників"
        }
      ]
    },
    {
      "id": "9.6.",
      "criterion": "Впровадження систем оцінювання персоналу",
      "text": "Чи прив’язана система мотивації до результатів оцінювання співробітників?",
      "options": [
        {
          "text": "Так, функціонує системно, система стимулів прив’язана до результатів",
          "value": 3,
          "recommendation": "Продовжувати оптимізацію системи мотивації, враховуючи результати оцінювання для підвищення залученості та продуктивності"
        },
        {
          "text": "Так, використовується частково",
          "value": 2,
          "recommendation": "Розширити інтеграцію результатів оцінювання у систему мотивації, щоб стимулювати досягнення ключових показників"
        },
        {
          "text": "Неформальне визначення",
          "value": 1,
          "recommendation": "Впровадити формалізовану систему стимулів, що базується на оцінці результатів працівників."
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Розширити інтеграцію результатів оцінювання у систему мотивації, щоб стимулювати досягнення ключових показників"
        }
      ]
    },
    {
      "id": "9.7.",
      "criterion": "Впровадження систем оцінювання персоналу",
      "text": "Чи застосовується система КРІ для оцінки персоналу?",
      "options": [
        {
          "text": "Так, інтегрована у систему управління персоналом",
          "value": 3,
          "recommendation": "Продовжувати оптимізацію та регулярний перегляд КРІ для підвищення ефективності оцінки та розвитку персоналу."
        },
        {
          "text": "Так, використовується тільки для окремих груп посад (працівників)",
          "value": 2,
          "recommendation": "Розширити застосування КРІ на більшість посад для уніфікації оцінки та мотивації."
        },
        {
          "text": "Планується впровадити",
          "value": 1,
          "recommendation": "Розробити і запровадити систему КРІ з чіткими цілями та метриками для всіх працівників."
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Впровадити систему КРІ як основу для прозорої оцінки ефективності та стимулювання персоналу."
        }
      ]
    },
    {
      "id": "9.8.",
      "criterion": "Впровадження систем оцінювання персоналу",
      "text": "Чи застосовується аналіз компетентностей?",
      "options": [
        {
          "text": "Так, застосовується системно",
          "value": 3,
          "recommendation": "Продовжувати підтримку та оновлення системи аналізу компетентностей для розвитку персоналу"
        },
        {
          "text": "Так, використовується тільки для окремих груп посад (працівників)",
          "value": 2,
          "recommendation": "Розширити застосування аналізу компетентностей на більшість посад для уніфікації процесу оцінки та розвитку"
        },
        {
          "text": "Планується впровадити",
          "value": 1,
          "recommendation": "Розробити методику аналізу компетентностей та впровадити її у систему управління персоналом."
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Впровадити системний аналіз компетентностей для об’єктивної оцінки потенціалу та розвитку працівників"
        }
      ]
    },
    {
      "id": "9.9.",
      "criterion": "Впровадження систем оцінювання персоналу",
      "text": "Чи враховуються результати оцінювання для побудови планів розвитку?",
      "options": [
        {
          "text": "Так, враховуються системно",
          "value": 3,
          "recommendation": "Продовжувати інтеграцію результатів оцінювання у плани розвитку для підвищення компетентностей та ефективності персоналу"
        },
        {
          "text": "Так, використовується тільки для окремих груп посад (працівників)",
          "value": 2,
          "recommendation": "Розширити застосування оцінювання для формування індивідуальних планів розвитку ключових співробітників"
        },
        {
          "text": "Планується впровадити таку практику",
          "value": 1,
          "recommendation": "Розробити механізм  використання результатів оцінювання для побудови планів розвитку та впровадити його в організації"
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Запровадити практику врахування результатів оцінювання при формуванні планів розвитку для підвищення мотивації та продуктивності"
        }
      ]
    },
    {
      "id": "9.10.",
      "criterion": "Впровадження систем оцінювання персоналу",
      "text": "Чи використовуються результати оцінювання для підвищення або пониження посад?",
      "options": [
        {
          "text": "Так, використовуються системно",
          "value": 3,
          "recommendation": "Продовжувати системне застосування результатів оцінювання для прийняття рішень щодо кар’єрного росту та розвитку персоналу"
        },
        {
          "text": "Так, використовується тільки для окремих груп посад (працівників)",
          "value": 2,
          "recommendation": "Розширити практику використання результатів оцінювання для підвищення або пониження на більшість посад"
        },
        {
          "text": "Планується впровадити таку практику",
          "value": 1,
          "recommendation": "Розробити політику використання оцінювання для кадрових рішень і поступово її впровадити."
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Впровадити систему, де результати оцінювання стають основою для підвищення, пониження та ротації персоналу"
        }
      ]
    },
    {
      "id": "10.1.",
      "criterion": "Рівень організації системи розвитку та збереження талантів",
      "text": "Чи є формалізована система розвитку талантів?",
      "options": [
        {
          "text": "Так, є структурована програма",
          "value": 3,
          "recommendation": "Продовжувати вдосконалення програми розвитку талантів з інтеграцією її в індивідуальні плани розвитку та моніторинг ефективності"
        },
        {
          "text": "Так, частково структурована",
          "value": 2,
          "recommendation": "Доповнити існуючу систему розвитку талантів формалізованими процедурами, планами та метриками для всіх ключових талантів"
        },
        {
          "text": "Є неформальна практика",
          "value": 1,
          "recommendation": "Систематизувати наявні практики розвитку талантів у формалізовану програму з чіткими цілями та відповідальними"
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Розробити та спровадити структуровану програму розвитку талантів, визначивши ключові позиції, плани навчання та механізм мотивації"
        }
      ]
    },
    {
      "id": "10.2.",
      "criterion": "Рівень організації системи розвитку та збереження талантів",
      "text": "Чи розробляються для працівників плани розвитку кар’єри?",
      "options": [
        {
          "text": "Так, є інтегрована практика",
          "value": 3,
          "recommendation": "Продовжувати підтримку та регулярне оновлення індивідуальних планів розвитку кар’єри для усіх категорій працівників"
        },
        {
          "text": "Так, розробляються для керівників та за запитом",
          "value": 2,
          "recommendation": "Розширити практику розробки планів розвитку кар’єри на всі категорії працівників і зробити її регулярною та системною."
        },
        {
          "text": "Так, розробляються епізодично",
          "value": 1,
          "recommendation": "Впровадити стандартизовану систему планування кар’єри з чіткими етапами та відповідальністю."
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Розробити систему планів розвитку кар’єри для усіх працівників із регулярним моніторингом прогресу"
        }
      ]
    },
    {
      "id": "10.3.",
      "criterion": "Рівень організації системи розвитку та збереження талантів",
      "text": "Чи є база талантів (кадровий резерв) в HRM-системі?",
      "options": [
        {
          "text": "Так, є інтегрована в систему HRM",
          "value": 3,
          "recommendation": "Продовжувати підтримку та регулярне оновлення бази талантів із аналітикою для стратегічного планування розвитку персоналу"
        },
        {
          "text": "Так, є внутрішня база в Excel",
          "value": 2,
          "recommendation": "Переформатовати дані про кадровий резерв з Excel до HRM-системи для централізованого управління та аналітики"
        },
        {
          "text": "Так, наявна частково",
          "value": 1,
          "recommendation": "Створити повну базу талантів із інтеграцією у HRM та регулярним оновленням."
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Розглянути необхідність впровадження бази талантів  у HRM для ефективного управління кадровим резервом і планування розвитку персоналу"
        }
      ]
    },
    {
      "id": "10.4.",
      "criterion": "Рівень організації системи розвитку та збереження талантів",
      "text": "Чи є в організації програми розвитку лідерських якостей?",
      "options": [
        {
          "text": "Так, стала практика інтегрована в систему управління персоналом",
          "value": 3,
          "recommendation": "Продовжити розвиток лідерських програм з регулярним оцінюванням ефективності та інтеграцією нових методик"
        },
        {
          "text": "Так, є програма для керівників та окремих посад",
          "value": 2,
          "recommendation": "Розширити охоплення програм розвитку лідерських якостей на більшу кількість потенційних лідерів та інтегрувати їх у систему управління персоналом"
        },
        {
          "text": "Так, епізодично проводяться окремі внутрішні або зовнішні заходи",
          "value": 1,
          "recommendation": "Систематизувати проведення заходів та створити структуровану програму розвитку лідерства."
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Розробити та впровадити комплексну програму розвитку лідерських якостей, інтегровану у HR-стратегію організації"
        }
      ]
    },
    {
      "id": "10.5.",
      "criterion": "Рівень організації системи розвитку та збереження талантів",
      "text": "Чи є в організації внутрішній освітній центр?",
      "options": [
        {
          "text": "Так, є діючий навчальний центр",
          "value": 3,
          "recommendation": "Продовжувати розвиток навчального центру, регулярно оновлювати програми під актуальні потреби організації"
        },
        {
          "text": "Так, проводяться внутрішні  заходи",
          "value": 2,
          "recommendation": "Систематизувати внутрішнє навчання та інтегрувати його у HR-стратегію для розвитку ключових компетентностей"
        },
        {
          "text": "Так, епізодично проводяться окремі тренінги",
          "value": 1,
          "recommendation": "Перетворити розрізнені тренінги на регулярну структуровану програму навчання."
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Створити внутрішній освітній центр або систему регулярного навчання для розвитку персоналу та підвищення кваліфікації"
        }
      ]
    },
    {
      "id": "10.6.",
      "criterion": "Рівень організації системи розвитку та збереження талантів",
      "text": "Чи є практика обміну кращим досвідом між підрозділами?",
      "options": [
        {
          "text": "Так, є регулярні програми best practice",
          "value": 3,
          "recommendation": "Продовжувати системну практику обміну досвідом і впроваджувати механізми поширення успішних кейсів у всій організації"
        },
        {
          "text": "Так, є практика неформального обміну досвідом",
          "value": 2,
          "recommendation": "Формалізувати існуючі неформальні обміни досвідом, створити регулярні сесії  чи платформи для обговорення кращих практик"
        },
        {
          "text": "Епізодично відбувається",
          "value": 1,
          "recommendation": "Перетворити випадкові обміни досвідом на регулярні програми для системного поширення знань."
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Впровадити програми обміну досвідом між підрозділами, щоб накопичувати та поширювати кращі практики у всій організації"
        }
      ]
    },
    {
      "id": "10.7.",
      "criterion": "Рівень організації системи розвитку та збереження талантів",
      "text": "Чи є практика проведення стратегічних сесій з залученням різних категорій працівників?",
      "options": [
        {
          "text": "Так, персонал активно залучається до проведення стратегічних сесій",
          "value": 3,
          "recommendation": "Підтримувати і розширювати залучення працівників у стратегічні сесії, інтегруючи їхні ідеї у планування та реалізацію стратегії."
        },
        {
          "text": "Персонал частково залучається до проведення стратегічних сесій",
          "value": 2,
          "recommendation": "Розширити залучення різних категорій працівників до проведення стратегічних сесій, щоб забезпечити більш комплексну участь та генерацію ідей"
        },
        {
          "text": "Планується проведення стратегічних сесій",
          "value": 1,
          "recommendation": "Прискорити впровадження стратегічних сесій та залучити представників ключових підрозділів для інтеграції у процес прийняття рішень"
        },
        {
          "text": "Ні і не планується",
          "value": 0,
          "recommendation": "Запровадити практику стратегічних сесій із залученням різних категорій працівників для підвищення прозорості і ефективності стратегічного планування"
        }
      ]
    },
    {
      "id": "10.8.",
      "criterion": "Рівень організації системи розвитку та збереження талантів",
      "text": "Чи застосовуються методи нематеріальної мотивації працівників?",
      "options": [
        {
          "text": "Так, розроблена система визнання, активно функціонують соціальні програми для усіх категорій працівників.",
          "value": 3,
          "recommendation": "Продовжувати розвивати та адаптувати програми нематеріальної мотивації, щоб підвищувати залученість і лояльність персоналу"
        },
        {
          "text": "Система нематеріальної мотивації  застосовується частково або не для усіх категорій працівників",
          "value": 2,
          "recommendation": "Розширити охоплення системи нематеріальної мотивації на всі категорії працівників та стандартизувати ці практики"
        },
        {
          "text": "Методи нематеріальної мотивації іноді застосовуються за рішенням керівництва",
          "value": 1,
          "recommendation": "Впровадити системний підхід до нематеріальної мотивації з чіткими правилами та регулярним застосуванням"
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Створити та впровадити комплексну систему нематеріальної мотивації, зокрема визнання, соціальні програми та корпоративну культуру"
        }
      ]
    },
    {
      "id": "10.9.",
      "criterion": "Рівень організації системи розвитку та збереження талантів",
      "text": "Чи застосовуються методи матеріальної мотивації працівників?",
      "options": [
        {
          "text": "Так, розроблена система винагород (гнучка оплата, гейміфікація), яка активно застосовується для усіх категорій працівників.",
          "value": 3,
          "recommendation": "Продовжувати підтримувати та регулярно аналізувати ефективність системи матеріальної мотивації, адаптуючи її до змін у бізнесі та очікувань працівників"
        },
        {
          "text": "Система матеріальної мотивації  застосовується частково або не для усіх категорій працівників",
          "value": 2,
          "recommendation": "Розглянути можливість охоплення матеріальною мотивацією всіх категорій персоналу та забезпечити її послідовне впровадження"
        },
        {
          "text": "Методи матеріальної мотивації іноді застосовуються за рішенням керівництва",
          "value": 1,
          "recommendation": "Впровадити системний підхід до матеріальної мотивації з чіткими правилами та регулярним застосуванням"
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Розробити та впровадити комплексну систему матеріальної мотивації, що включає прозорі винагороди, бонуси та стимулюючі програми"
        }
      ]
    },
    {
      "id": "10.10.",
      "criterion": "Рівень організації системи розвитку та збереження талантів",
      "text": "Чи є система бонусів за лояльність?",
      "options": [
        {
          "text": "Так, розроблена дієва система винагород за лояльність",
          "value": 3,
          "recommendation": "Продовжувати підтримувати та регулярно аналізувати ефективність системи бонусів за лояльність, адаптуючи її до потреб працівників та стратегії організації"
        },
        {
          "text": "Система винагород за лояльність  застосовується частково або не для усіх категорій працівників",
          "value": 2,
          "recommendation": "Розширити охоплення програми бонусів за лояльність та забезпечити їх послідовне застосування"
        },
        {
          "text": "Бонуси за лояльність іноді застосовуються за рішенням керівництва",
          "value": 1,
          "recommendation": "Впровадити системний підхід до бонусів за лояльність із чіткими правилами та регулярним наданням винагород"
        },
        {
          "text": "Ні",
          "value": 0,
          "recommendation": "Розробити та впровадити комплексну систему бонусів за лояльність, що стимулює тривалу співпрацю та утримання цінних працівників"
        }
      ]
    }
  ]
};
